<%@page pageEncoding="UTF-8"%>

<div align='left'>
ORA-00001: 違反唯一約束條件 (.) <br>
ORA-00017: 請求會話以設置跟蹤事件 <br>
ORA-00018: 超出最大會話數 <br>
ORA-00019: 超出最大會話許可數 <br>
ORA-00020: 超出最大進程數 () <br>
ORA-00021: 會話附屬於其它某些進程；無法轉換會話 <br>
ORA-00022: 無效的會話 ID；訪問被拒絕 <br>
ORA-00023: 會話引用進程私用內存；無法分離會話 <br>
ORA-00024: 單一進程模式下不允許從多個進程注冊 <br>
ORA-00025: 無法分配  <br>
ORA-00026: 丟失或無效的會話 ID <br>
ORA-00027: 無法刪去當前會話 <br>
ORA-00028: 您的會話己被刪去 <br>
ORA-00029: 會話不是用戶會話 <br>
ORA-00030: 用戶會話 ID 不存在。 <br>
ORA-00031: 標記要刪去的會話 <br>
ORA-00032: 無效的會話移植口令 <br>
ORA-00033: 當前的會話具有空的移植口令 <br>
ORA-00034: 無法在當前 PL/SQL 會話中  <br>
ORA-00035: LICENSE_MAX_USERS 不能小於當前用戶數 <br>
ORA-00036: 超過遞歸 SQL () 級的最大值 <br>
ORA-00037: 無法轉換到屬於不同服務器組的會話 <br>
ORA-00038: 無法創建會話: 服務器組屬於其它用戶 <br>
ORA-00050: 獲取入隊時操作系統出錯 <br>
ORA-00051: 等待資源超時 <br>
ORA-00052: 超出最大入隊資源數 () <br>
ORA-00053: 超出最大入隊數 <br>
ORA-00054: 資源正忙，要求指定 NOWAIT <br>
ORA-00055: 超出 DML ?的最大數 <br>
ORA-00056: 對象 '.' 上的 DDL ?以不兼容模式掛起 <br>
ORA-00057: 超出臨時表?的最大數 <br>
ORA-00058: DB_BLOCK_SIZE 必須?才可安裝此數據庫 (非 ) <br>
ORA-00059: 超出 DB_FILES 的最大值 <br>
ORA-00060: 等待資源時檢測到死? <br>
ORA-00061: 另一個例程設置了不同的 DML_LOCKS <br>
ORA-00062: 無法獲得 DML 全表?定；DML_LOCKS ? 0 <br>
ORA-00063: 超出 LOG_FILES 的最大數 <br>
ORA-00064: 對象過大以至無法分配在此 O/S (，) <br>
ORA-00065: FIXED_DATE 的初始化失敗 <br>
ORA-00066: LOG_FILES ?  但需要成?  才可兼容 <br>
ORA-00067: 值  對?數  無效；至少必須?  <br>
ORA-00068: 值  對?數  無效，必須在  和  之間 <br>
ORA-00069: 無法獲得?定 -- 禁用了表?定 <br>
ORA-00070: 命令無效 <br>
ORA-00071: 進程號必須介於 1 和  之間 <br>
ORA-00072: 進程""不活動 <br>
ORA-00073: 命令  介於  和  個?數之間時使用 <br>
ORA-00074: 未指定進程 <br>
ORA-00075: 在此例程未找到進程 "" <br>
ORA-00076: 未找到轉儲  <br>
ORA-00077: 轉儲  無效 <br>
ORA-00078: 無法按名稱轉儲變量 <br>
ORA-00079: 未找到變量  <br>
ORA-00080: 層次  指定的全局區域無效 <br>
ORA-00081: 地址範圍 [，) 不可讀 <br>
ORA-00082:  的內存大小不在有效集合 [1], [2], [4] 之內 <br>
ORA-00083: 警告: 可能損壞映射的 SGA  <br>
ORA-00084: 全局區域必須? PGA, SGA 或 UGA <br>
ORA-00085: 當前調用不存在 <br>
ORA-00086: 用戶調用不存在 <br>
ORA-00087: 命令無法在遠程例程上執行 <br>
ORA-00088: 共享服務器無法執行命令 <br>
ORA-00089: ORADEBUG 命令中無效的例程號 <br>
ORA-00090: 未能將內存分配?群集數據庫 ORADEBUG 命令 <br>
ORA-00091: LARGE_POOL_SIZE 至少必須?  <br>
ORA-00092: LARGE_POOL_SIZE 必須大於 LARGE_POOL_MIN_ALLOC <br>
ORA-00093:  必須介於  和  之間 <br>
ORA-00094:  要求整數值 <br>
ORA-00096: 值  對?數  無效，它必須來自  之間 <br>
ORA-00097: 使用 Oracle SQL 特性不在 SQL92  級中 <br>
ORA-00099: 等待資源時發生超時，可能是 PDML 死?所致 <br>
ORA-00100: 未找到數據 <br>
ORA-00101: 系統?數 DISPATCHERS 的說明無效 <br>
ORA-00102: 調度程序無法使用網?協議  <br>
ORA-00103: 無效的網?協議；供調度程序備用 <br>
ORA-00104: 檢測到死?；全部公用服務器已?定等待資源 <br>
ORA-00105: 未配置網?協議  的調度機制 <br>
ORA-00106: 無法在連接到調度程序時?動/關閉數據庫 <br>
ORA-00107: 無法連接到 ORACLE 監聽器進程 <br>
ORA-00108: 無法設置調度程序以同步進行連接 <br>
ORA-00111: 由於服務器數目限制在 , 所以沒有?動所有服務器 <br>
ORA-00112: 僅能創建多達  (最多指定) 個調度程序 <br>
ORA-00113: 協議名  過長 <br>
ORA-00114: 缺少系統?數 SERVICE_NAMES 的值 <br>
ORA-00115: 連接被拒絕；調度程序連接表已滿 <br>
ORA-00116: SERVICE_NAMES 名過長 <br>
ORA-00117: 系統?數 SERVICE_NAMES 的值超出範圍 <br>
ORA-00118: 系統?數 DISPATCHERS 的值超出範圍 <br>
ORA-00119: 系統?數  的說明無效 <br>
ORA-00120: 未?用或安裝調度機制 <br>
ORA-00121: 在缺少 DISPATCHERS 的情況下指定了 SHARED_SERVERS <br>
ORA-00122: 無法初始化網?配置 <br>
ORA-00123: 空閑公用服務器終止 <br>
ORA-00124: 在缺少 MAX_SHARED_SERVERS 的情況下指定了 DISPATCHERS <br>
ORA-00125: 連接被拒絕；無效的演示文稿 <br>
ORA-00126: 連接被拒絕；無效的重复 <br>
ORA-00127: 調度進程  不存在 <br>
ORA-00128: 此命令需要調度進程名 <br>
ORA-00129: 監聽程序地址驗證失敗 '' <br>
ORA-00130: 監聽程序地址 '' 無效 <br>
ORA-00131: 網?協議不支持注冊 '' <br>
ORA-00132: 語法錯誤或無法解析的網?名稱 '' <br>
ORA-00150: 重复的事務處理 ID <br>
ORA-00151: 無效的事務處理 ID <br>
ORA-00152: 當前會話與請求的會話不匹配 <br>
ORA-00153: XA 庫中的內部錯誤 <br>
ORA-00154: 事務處理監視器中的協議錯誤 <br>
ORA-00155: 無法在全局事務處理之外執行工作 <br>
ORA-00160: 全局事務處理長度  超出了最大值 () <br>
ORA-00161: 事務處理的分支長度  非法 (允許的最大長度? ) <br>
ORA-00162: 外部 dbid 的長度  超出了最大值 () <br>
ORA-00163: 內部數據庫名長度  超出了最大值 () <br>
ORA-00164: 在分布式事務處理中不允許獨立的事務處理 <br>
ORA-00165: 不允許對遠程操作進行可移植分布式自治轉換 <br>
ORA-00200: 無法創建控制文件 <br>
ORA-00201: 控制文件版本  與 ORACLE 版本  不兼容 <br>
ORA-00202: 控制文件: '' <br>
ORA-00203: 使用錯誤的控制文件 <br>
ORA-00204: 讀控制文件時出錯 (塊 ，# 塊 ) <br>
ORA-00205: 標識控制文件出錯，有關詳情，請檢查警告日志 <br>
ORA-00206: 寫控制文件時出錯 (塊 ，# 塊 ) <br>
ORA-00207: 控制文件不能用於同一數據庫 <br>
ORA-00208: 控制文件的名稱數超出限制  <br>
ORA-00209: 控制文件塊大小不匹配，有關詳情，請檢查警告日志 <br>
ORA-00210: 無法打開指定的控制文件 <br>
ORA-00211: 控制文件與先前的控制文件不匹配 <br>
ORA-00212: 塊大小  低於要求的最小大小 ( 字節) <br>
ORA-00213: 不能重新使用控制文件；原文件大小? ，還需  <br>
ORA-00214: 控制文件 '' 版本  與文件 '' 版本  不一致 <br>
ORA-00215: 必須至少存在一個控制文件 <br>
ORA-00216: 無法重新調整從 8.0.2 移植的控制文件大小 <br>
ORA-00217: 從 9.0.1 進行移植無法重新調整控制文件的大小 <br>
ORA-00218: 控制文件的塊大小  與 DB_BLOCK_SIZE () 不匹配 <br>
ORA-00219: 要求的控制文件大小  超出了允許的最大值  <br>
ORA-00220: 第一個例程未安裝控制文件，有關詳情，請檢查警告日志 <br>
ORA-00221: 寫入控制文件出錯 <br>
ORA-00222: 操作將重新使用當前已安裝控制文件的名稱 <br>
ORA-00223: 轉換文件無效或版本不正確 <br>
ORA-00224: 控制文件重設大小嘗試使用非法記錄類型 () <br>
ORA-00225: 控制文件的預期大小  與實際大小  不同 <br>
ORA-00226: 備用控制文件打開時不允許進行操作 <br>
ORA-00227: 控制文件中檢測到損壞的塊: (塊 ，# 塊 ) <br>
ORA-00228: 備用控制文件名長度超出了最大長度  <br>
ORA-00229: 操作不允許: 已掛起快照控制文件入隊 <br>
ORA-00230: 操作不允許: 無法使用快照控制文件入隊 <br>
ORA-00231: 快照控制文件未命名 <br>
ORA-00232: 快照控制文件不存在, 已損壞或無法讀取 <br>
ORA-00233: 控制文件副本已損壞或無法讀取 <br>
ORA-00234: 標識或打開快照或复制控制文件時出錯 <br>
ORA-00235: 控制文件固定表因並發更新而不一致 <br>
ORA-00236: 快照操作不允許: 掛上的控制文件?備份文件 <br>
ORA-00237: 快照操作不允許: 控制文件新近創建 <br>
ORA-00238: 操作將重用屬於數據庫一部分的文件名 <br>
ORA-00250: 未?動存檔器 <br>
ORA-00251: LOG_ARCHIVE_DUPLEX_DEST 不能是與字符串  相同的目的地 <br>
ORA-00252: 日志  在線程  上?空，無法存檔 <br>
ORA-00253: 字符限制在  以內，歸檔目的字符串  超出此限制 <br>
ORA-00254: 存檔控制字符串 '' 時出錯 <br>
ORA-00255: 存檔日志  (線程 , 序列 # ) 時出錯 <br>
ORA-00256: 無法翻譯歸檔目的字符串  <br>
ORA-00257: 存檔器錯誤。在釋放之前僅限於內部連接 <br>
ORA-00258: NOARCHIVELOG 模式下的人工存檔必須標識日志 <br>
ORA-00259: 日志  (打開線程 ) ?當前日志，無法存檔 <br>
ORA-00260: 無法找到聯機日志序列  (線程 ) <br>
ORA-00261: 正在存檔或修改日志  (線程 ) <br>
ORA-00262: 當前日志  (關閉線程 ) 無法切換 <br>
ORA-00263: 線程  沒有需要存檔的記錄 <br>
ORA-00264: 不要求恢复 <br>
ORA-00265: 要求例程恢复，無法設置 ARCHIVELOG 模式 <br>
ORA-00266: 需要存檔日志文件名 <br>
ORA-00267: 無需存檔日志文件名 <br>
ORA-00268: 指定的日志文件不存在 '' <br>
ORA-00269: 指定的日志文件?線程  的一部分 (非 ) <br>
ORA-00270: 創建存檔日志  時出錯 <br>
ORA-00271: 沒有需要存檔的日志 <br>
ORA-00272: 寫存檔日志  時出錯 <br>
ORA-00273: 未記錄的直接加載數據的介質恢复 <br>
ORA-00274: 非法恢复選項  <br>
ORA-00275: 已經開始介質恢复 <br>
ORA-00276: CHANGE 關鍵字已指定但未?出更改編號 <br>
ORA-00277: UNTIL 恢复標志  的非法選項 <br>
ORA-00278: 此恢复不再需要日志文件 '' <br>
ORA-00279: 更改  (在  生成) 對於線程  是必需的 <br>
ORA-00280: 更改  對於線程  是按序列 #  進行的 <br>
ORA-00281: 不能使用調度進程執行介質恢复 <br>
ORA-00282: UPI  調用不被支持，請使用 ALTER DATABASE RECOVER <br>
ORA-00283: 恢复會話因錯誤而取消 <br>
ORA-00284: 恢复會話仍在進行 <br>
ORA-00285: TIME 未作?字符串常數?出 <br>
ORA-00286: 無可用成員，或成員無有效數據 <br>
ORA-00287: 未找到指定的更改編號  (在線程  中) <br>
ORA-00288: 要繼續恢复，請鍵入 ALTER DATABASE RECOVER CONTINUE <br>
ORA-00289: 建議:  <br>
ORA-00290: 操作系統出現存檔錯誤。請?閱下面的錯誤 <br>
ORA-00291: PARALLEL 選項要求數字值 <br>
ORA-00292: 未安裝並行恢复功能 <br>
ORA-00293: 控制文件與重做日志不同步 <br>
ORA-00294: 無效的存檔日志格式標識 '' <br>
ORA-00295: 數據文件號  無效，必須介於 1 與  之間 <br>
ORA-00296: 已超出 RECOVER DATAFILE LIST 的最大文件數 () <br>
ORA-00297: 必須在 RECOVER DATAFILE START 之前指定 RECOVER DATAFILE LIST <br>
ORA-00298: 丟失或無效的 TIMEOUT 間隔 <br>
ORA-00299: 必須在數據文件  上使用文件級介質恢复 <br>
ORA-00300: 指定的重做日志塊大小  非法 - 超出限制  <br>
ORA-00301: 添加日志文件 '' 時出錯 - 無法創建文件 <br>
ORA-00302: 日志超出限制  <br>
ORA-00303: 無法處理多次中斷的重做 <br>
ORA-00304: 請求的 INSTANCE_NUMBER 在使用中 <br>
ORA-00305: 日志  (線程 ) 不一致；屬於另一個數據庫 <br>
ORA-00306: 此數據庫中的例程限制  <br>
ORA-00307: 請求的 INSTANCE_NUMBER 超出限制，最大?  <br>
ORA-00308: 無法打開存檔日志 '' <br>
ORA-00309: 日志屬於錯誤的數據庫 <br>
ORA-00310: 存檔日志包含序列 ；要求序列  <br>
ORA-00311: 無法從存檔日志讀取標題 <br>
ORA-00312: 聯機日志  線程 : '' <br>
ORA-00313: 無法打開日志組  (線程 ) 的成員 <br>
ORA-00314: 日志  (線程 )，預計序號  與  不匹配 <br>
ORA-00315: 日志  (線程 )，標題中的線程 #  錯誤 <br>
ORA-00316: 日志  (線程 )，標題中的類型  不是日志文件 <br>
ORA-00317: 標題中的文件類型  不是日志文件 <br>
ORA-00318: 日志  (線程 )，預計文件大小  與  不匹配 <br>
ORA-00319: 日志  (線程 ) 具有錯誤的日志重置狀態 <br>
ORA-00320: 無法從日志  (線程 ) 讀取文件標題 <br>
ORA-00321: 日志  (線程 )，無法更新日志文件標題 <br>
ORA-00322: 日志  (線程 ) 不是當前副本 <br>
ORA-00323: 線程  的當前日志不可用而所有其它日志均需要存檔 <br>
ORA-00324: 日志文件 '' 的翻譯名 '' 太長， 字符超出  限制 <br>
ORA-00325: 已歸檔線程  的日志，標題中的線程 #  錯誤 <br>
ORA-00326: 日志在更改  開始，需要更早的更改  <br>
ORA-00327: 日志  (線程 )，實際大小  小於需要的  <br>
ORA-00328: 歸檔日志在更改  結束，需要稍後的更改  <br>
ORA-00329: 歸檔日志在更改  開始，需要更改  <br>
ORA-00330: 歸檔日志在更改  結束，需要更改  <br>
ORA-00331: 日志版本  與 ORACLE 版本  不兼容 <br>
ORA-00332: 歸檔日志過小 - 可能未完全歸檔 <br>
ORA-00333: 重做日志讀取塊  計數  出錯 <br>
ORA-00334: 歸檔日志: '' <br>
ORA-00335: 聯機日志 : 沒有此編號的日志，日志不存在 <br>
ORA-00336: 大小?  的日志文件塊數小於最小  塊數 <br>
ORA-00337: 日志文件 '' 不存在且未指定大小 <br>
ORA-00338: 日志  (線程 ) 比控制文件更新 <br>
ORA-00339: 歸檔日志未包含任何重做 <br>
ORA-00340: 處理聯機日志  (線程 ) 時出現 I/O 錯誤 <br>
ORA-00341: 日志  (線程 )，標題中的日志 #  錯誤 <br>
ORA-00342: 歸檔日志在上一個 RESETLOGS 之前創建程序包 <br>
ORA-00343: 錯誤過多，已關閉日志成員 <br>
ORA-00344: 無法重新創建聯機日志 '' <br>
ORA-00345: 重做日志寫入塊  計數  出錯 <br>
ORA-00346: 日志成員標記? STALE <br>
ORA-00347: 日志  (線程 )，預計塊大小  與  不匹配 <br>
ORA-00348: 單一進程重做失敗；必須中止例程 <br>
ORA-00349: 無法獲得 '' 的塊大小 <br>
ORA-00350: 日志  (線程 ) 中需要歸檔 <br>
ORA-00351: recover-to 時間無效 <br>
ORA-00352: 線程  的所有日志均需要歸檔 - 無法?用 <br>
ORA-00353: 日志損壞接近塊  更改  時間  <br>
ORA-00354: 損壞重做日志塊標題 <br>
ORA-00355: 更改編號無次序 <br>
ORA-00356: 更改說明中的長度不一致 <br>
ORA-00357: 日志文件指定了過多成員，最大?  <br>
ORA-00358: 指定了過多文件成員，最大?  <br>
ORA-00359: 日志文件組  不存在 <br>
ORA-00360: 非日志文件成員:  <br>
ORA-00361: 無法刪除最後一個日志成員  (組 ) <br>
ORA-00362: 組成組  中的有效日志文件要求輸入成員 <br>
ORA-00363: 日志不是歸檔版本 <br>
ORA-00364: 無法將標題寫入新日志成員 <br>
ORA-00365: 指定日志不是正確的下一個日志 <br>
ORA-00366: 日志  (線程 )，文件標題中的校驗和錯誤 <br>
ORA-00367: 日志文件標題中的校驗和錯誤 <br>
ORA-00368: 重做日志塊中的校驗和錯誤 <br>
ORA-00369: 線程  的當前日志不可用且其它日志已被清除 <br>
ORA-00370: Rcbchange 操作過程中可能出現死? <br>
ORA-00371: 共享池內存不足 <br>
ORA-00372: 此時無法修改文件  <br>
ORA-00373: 聯機日志版本  與 ORACLE 版本  不兼容 <br>
ORA-00374: ?數 db_block_size =  無效; 它必須是  的倍數, 範圍? [..] <br>
ORA-00375: 無法獲得默認 db_block_size <br>
ORA-00376: 此時無法讀取文件  <br>
ORA-00377: 文件  的頻繁備份導致寫操作延遲 <br>
ORA-00378: 無法按指定創建緩沖池 <br>
ORA-00379: 緩沖池  中無法提供 K 塊大小的空閑緩沖區 <br>
ORA-00380: 無法指定 db_k_cache_size, 因? K 是標准塊大小 <br>
ORA-00381: 無法將新?數和舊?數同時用於緩沖區高速緩存的大小說明 <br>
ORA-00382:  不是有效的塊大小, 有效範圍? [..] <br>
ORA-00383: DEFAULT 高速緩存的塊大小  不能減少至零 <br>
ORA-00384: 沒有足夠的內存來增加高速緩存的大小 <br>
ORA-00385: cannot enable Very Large Memory with new buffer cache parameters <br>
ORA-00390: 日志  (線程 ) 正被清除，無法成?當前日志 <br>
ORA-00391: 所有線程必須同時轉換?新的日志格式 <br>
ORA-00392: 日志  (線程 ) 正被清除，不允許操作 <br>
ORA-00393: 脫機數據文件的恢复需要日志  (線程 ) <br>
ORA-00394: 在嘗試存檔時重新使用聯機日志 <br>
ORA-00395: '克隆' 數據庫的聯機日志必須重命名 <br>
ORA-00396: 錯誤  需要退回到單次遍曆恢复 <br>
ORA-00397: 對於文件  (塊 ), 檢測到寫入丟失情況 <br>
ORA-00398: 由於重新配置而中止了線程恢复 <br>
ORA-00399: 重做日志中的更改說明已損壞 <br>
ORA-00400: 無效的版本值  (對於?數 ) <br>
ORA-00401: 此版本不支持?數  的值 <br>
ORA-00402: 版本  的數據庫更改無法用於版本  <br>
ORA-00403:  () 不同於其它例程 () <br>
ORA-00404: 未找到轉換文件: '' <br>
ORA-00405: 兼容類型"" <br>
ORA-00406: COMPATIBLE ?數需要?  或更大 <br>
ORA-00407: 不允許從版本 . 到 . 滾動升級 <br>
ORA-00408: ?數  設置? TRUE <br>
ORA-00409: COMPATIBLE 必須是  或更高值才能使用 AUTO SEGMENT SPACE MANAGEMENT <br>
ORA-00436: 沒有 ORACLE 軟件使用權，請與 Oracle 公司聯系獲得幫助 <br>
ORA-00437: 沒有 ORACLE 軟件功能使用權，請與 Oracle 公司聯系獲得幫助 <br>
ORA-00438: 未安裝  選項 <br>
ORA-00439: 未?用特性:  <br>
ORA-00443: 背景進程 "" 未?動 <br>
ORA-00444: 背景進程 "" ?動時失敗 <br>
ORA-00445: 背景進程 "" 在  秒之後仍沒有?動 <br>
ORA-00446: 背景進程意外?動 <br>
ORA-00447: 背景進程出現致命錯誤 <br>
ORA-00448: 背景進程正常結束 <br>
ORA-00449: 背景進程 '' 因錯誤  異常終止 <br>
ORA-00470: LGWR 進程因錯誤而終止 <br>
ORA-00471: DBWR 進程因錯誤而終止 <br>
ORA-00472: PMON 進程因錯誤而終止 <br>
ORA-00473: ARCH 進程因錯誤而終止 <br>
ORA-00474: SMON 進程因錯誤而終止 <br>
ORA-00475: TRWR 進程因錯誤而終止 <br>
ORA-00476: RECO 進程因錯誤而終止 <br>
ORA-00477: SNP* 進程因錯誤而終止 <br>
ORA-00478: SMON 進程由於  錯誤終止 <br>
ORA-00480: LCK* 進程因錯誤而終止 <br>
ORA-00481: LMON 進程因錯誤而終止 <br>
ORA-00482: LMD* 進程因錯誤而終止 <br>
ORA-00483: 關閉進程過程中異常終止 <br>
ORA-00484: LMS* 進程因錯誤而終止 <br>
ORA-00485: DIAG 進程由於  錯誤終止 <br>
ORA-00486: 功能不可用 <br>
ORA-00568: 超出中斷處理程序的最大數 <br>
ORA-00574: osndnt: $CANCEL 失敗 (中斷) <br>
ORA-00575: osndnt: $QIO 失敗 (發送 out-of-band 中斷) <br>
ORA-00576: 帶內中斷協議錯誤 <br>
ORA-00577: 帶外中斷協議錯誤 <br>
ORA-00578: 重置協議錯誤 <br>
ORA-00579: osndnt: 服務器收到連接請求格式不正確 <br>
ORA-00580: 協議版本不匹配 <br>
ORA-00581: osndnt: 無法分配上下文區域 <br>
ORA-00582: osndnt: 無法撤消分配上下文區域 <br>
ORA-00583: osndnt: $TRNLOG 失敗 <br>
ORA-00584: 無法關閉連接 <br>
ORA-00585: 主機名稱格式錯誤 <br>
ORA-00586: osndnt: LIB$ASN_WTH_MBX 失敗 <br>
ORA-00587: 無法連接到遠程主機 <br>
ORA-00588: 來自主機的信息過短 <br>
ORA-00589: 來自主機的信息數據長度錯誤 <br>
ORA-00590: 來自主機的信息類型錯誤 <br>
ORA-00591: 寫入的字節數錯誤 <br>
ORA-00592: osndnt: $QIO 失敗 (郵箱隊列) <br>
ORA-00593: osndnt: $DASSGN 失敗 (網?設備) <br>
ORA-00594: osndnt: $DASSGN 失敗 (郵箱) <br>
ORA-00595: osndnt: $QIO 失敗 (接收) <br>
ORA-00596: osndnt: $QIO 失敗 (發送) <br>
ORA-00597: osndnt: $QIO 失敗 (郵箱隊列) <br>
ORA-00598: osndnt: $QIO IO 失敗 (郵箱讀取) <br>
ORA-00600: 內部錯誤代碼，?數: [], [], [], [], [], [], [], [] <br>
ORA-00601: 清除?定沖突 <br>
ORA-00602: 內部編程異常錯誤 <br>
ORA-00603: ORACLE 服務器會話因致命錯誤而終止 <br>
ORA-00604: 遞歸 SQL 層  出現錯誤 <br>
ORA-00606: 內部錯誤代碼 <br>
ORA-00607: 當更改數據塊時出現內部錯誤 <br>
ORA-00701: 無法改變熱?動數據庫所需的對象 <br>
ORA-00702: 引導程序版本 '' 與版本 '' 不一致 <br>
ORA-00703: 超出行高速緩存例程?的最大數 <br>
ORA-00704: 引導程序進程失敗 <br>
ORA-00705: ?動過程中的狀態不一致；請在關閉例程後重新?動 <br>
ORA-00706: 更改文件 '' 的格式時出錯 <br>
ORA-00816: 錯誤信息無法轉換 <br>
ORA-00900: 無效 SQL 語句 <br>
ORA-00901: 無效 CREATE 命令 <br>
ORA-00902: 無效數據類型 <br>
ORA-00903: 表名無效 <br>
ORA-00904: : 無效的標識符 <br>
ORA-00905: 缺少關鍵字 <br>
ORA-00906: 缺少左括號 <br>
ORA-00907: 缺少右括號 <br>
ORA-00908: 缺少 NULL 關鍵字 <br>
ORA-00909: ?數個數無效 <br>
ORA-00910: 指定的長度對於數據類型而言過長 <br>
ORA-00911: 無效字符 <br>
ORA-00913: 值過多 <br>
ORA-00914: 缺少 ADD 關鍵字 <br>
ORA-00915: 當前不允許網?訪問字典表 <br>
ORA-00917: 缺少逗號 <br>
ORA-00918: 未明確定義列 <br>
ORA-00919: 無效函數 <br>
ORA-00920: 無效的關系運算符 <br>
ORA-00921: 未預期的 SQL 命令結尾 <br>
ORA-00922: 缺少或無效選項 <br>
ORA-00923: 未找到預期 FROM 關鍵字 <br>
ORA-00924: 缺少 BY 關鍵字 <br>
ORA-00925: 缺失 INTO 關鍵字 <br>
ORA-00926: 缺少 VALUES 關鍵字 <br>
ORA-00927: 缺少等號 <br>
ORA-00928: 缺少 SELECT 關鍵字 <br>
ORA-00929: 缺少句號 <br>
ORA-00930: 缺少星號 <br>
ORA-00931: 缺少標識 <br>
ORA-00932: 不一致的數據類型: 要求  得到的卻是  <br>
ORA-00933: SQL 命令未正確結束 <br>
ORA-00934: 此處不允許使用分組函數 <br>
ORA-00935: 分組函數的嵌套太深 <br>
ORA-00936: 缺少表達式 <br>
ORA-00937: 非單組分組函數 <br>
ORA-00938: 函數沒有足夠的?數 <br>
ORA-00939: 函數的?數過多 <br>
ORA-00940: 無效的 ALTER 命令 <br>
ORA-00941: 群集名缺少 <br>
ORA-00942: 表或視圖不存在 <br>
ORA-00943: 群集不存在 <br>
ORA-00944: 沒有足夠的聚簇列數 <br>
ORA-00945: 指定的聚簇列不存在 <br>
ORA-00946: 缺少 TO 關鍵字 <br>
ORA-00947: 沒有足夠的值 <br>
ORA-00948: 不再支持 ALTER CLUSTER 語句 <br>
ORA-00949: 非法引用遠程數據庫 <br>
ORA-00950: 無效 DROP 選項 <br>
ORA-00951: 群集非空 <br>
ORA-00952: 缺少 GROUP 關鍵字 <br>
ORA-00953: 缺少或無效索引名 <br>
ORA-00954: 缺少 IDENTIFIED 關鍵字 <br>
ORA-00955: 名稱已由現有對象使用 <br>
ORA-00956: 缺少或無效審計選項 <br>
ORA-00957: 列名重复 <br>
ORA-00958: 缺少 CHECK 關鍵字 <br>
ORA-00959: 表空間''不存在 <br>
ORA-00960: 選擇列表中的命名含糊 <br>
ORA-00961: 錯誤的日期/間隔值 <br>
ORA-00962: group-by / order-by 表達式過多 <br>
ORA-00963: 不支持的間隔類型 <br>
ORA-00964: 表名不在 FROM 列表中 <br>
ORA-00965: 列別名中不允許'*' <br>
ORA-00966: 缺少 TABLE 關鍵字 <br>
ORA-00967: 缺少 WHERE 關鍵字 <br>
ORA-00968: 缺少 INDEX 關鍵字 <br>
ORA-00969: 缺少 ON 關鍵字 <br>
ORA-00970: 缺少 WITH 關鍵字 <br>
ORA-00971: 缺少 SET 關鍵字 <br>
ORA-00972: 標識過長 <br>
ORA-00973: 無效的行數估計 <br>
ORA-00974: 無效 PCTFREE 值 (百分比) <br>
ORA-00975: 不允許日期 + 日期 <br>
ORA-00976: 此處不允許? LEVEL, PRIOR 或 ROWNUM <br>
ORA-00977: 重复的審計選項 <br>
ORA-00978: 嵌套分組函數沒有 GROUT BY <br>
ORA-00979: 不是 GROUP BY 表達式 <br>
ORA-00980: 同義詞轉換不再有效 <br>
ORA-00981: 不能將表和系統審計選項混在一起 <br>
ORA-00982: 缺少加號 <br>
ORA-00984: 列在此處不允許 <br>
ORA-00985: 無效的程序名 <br>
ORA-00986: 缺少或無效組名 <br>
ORA-00987: 缺少或無效用戶名 <br>
ORA-00988: 缺少或無效口令 <br>
ORA-00989: ?出的用戶名口令過多 <br>
ORA-00990: 缺少或無效權限 <br>
ORA-00991: 過程僅有 MAC 權限 <br>
ORA-00992: REVOKE 命令格式無效 <br>
ORA-00993: 缺少 GRANT 關鍵字 <br>
ORA-00994: 缺少 OPTION 關鍵字 <br>
ORA-00995: 缺少或無效同義詞標識 <br>
ORA-00996: 連接運算符是 || 而不是 | <br>
ORA-00997: 非法使用 LONG 數據類型 <br>
ORA-00998: 必須使用列別名命名此表達式 <br>
ORA-00999: 無效的視圖名 <br>
ORA-01000: 超出打開遊標的最大數 <br>
ORA-01001: 無效的遊標 <br>
ORA-01002: 讀取違反順序 <br>
ORA-01003: 語句未進行語法分析 <br>
ORA-01004: 不支持默認用戶名特性；登錄被拒絕 <br>
ORA-01005: 未?出口令；登錄被拒絕 <br>
ORA-01006: 賦值變量不存在 <br>
ORA-01007: 選擇列表中沒有變量 <br>
ORA-01008: 並非所有變量都已關聯 <br>
ORA-01009: 缺少法定?數 <br>
ORA-01010: 無效的 OCI 操作 <br>
ORA-01011: 在與第 6 版服務器會話時不能使用第 7 版兼容模式 <br>
ORA-01012: 沒有登錄 <br>
ORA-01013: 用戶請求取消當前的操作 <br>
ORA-01014: ORACLE 正在關閉過程中 <br>
ORA-01015: 循環登錄請求 <br>
ORA-01016: 此函數僅可以在讀取後調用 <br>
ORA-01017: 無效的用戶名/口令；拒絕登錄 <br>
ORA-01018: 列不具有 LONG 數據類型 <br>
ORA-01019: 無法在用戶方分配內存 <br>
ORA-01020: 未知的上下文狀態 <br>
ORA-01021: 指定的上下文大小無效 <br>
ORA-01022: 此配置中不支持數據庫操作 <br>
ORA-01023: 未找到遊標上下文 (無效的遊標編號) <br>
ORA-01024: OCI 調用中的數據類型無效 <br>
ORA-01025: UPI ?數超出範圍 <br>
ORA-01026: 賦值列表中存在多個大小 &gt; 4000 的緩沖區 <br>
ORA-01027: 在數據定義操作中不允許對變量賦值 <br>
ORA-01028: 內部雙工錯誤 <br>
ORA-01029: 內部雙工錯誤 <br>
ORA-01030: SELECT ...INTO 變量不存在 <br>
ORA-01031: 權限不足 <br>
ORA-01032: 沒有這?的用戶標識 <br>
ORA-01033: ORACLE 正在初始化或關閉過程中 <br>
ORA-01034: ORACLE 不可用 <br>
ORA-01035: ORACLE 只允許具有 RESTRICTED SESSION 權限的用戶使用 <br>
ORA-01036: 非法的變量名/編號 <br>
ORA-01037: 超出最大遊標內存 <br>
ORA-01038: 無法寫入數據庫文件版本  (使用 ORACLE 版本 ) <br>
ORA-01039: 視圖基本對象的權限不足 <br>
ORA-01040: 口令中的字符無效；登錄被拒絕 <br>
ORA-01041: 內部錯誤，hostdef 擴展名不存在 <br>
ORA-01042: 不允許使用打開遊標分離會話 <br>
ORA-01043: 用戶方內存損壞 [], [], [], [] <br>
ORA-01044: 緩沖區大小  (與變量關聯) 超出了最大限制  <br>
ORA-01045: 用戶  沒有 CREATE SESSION 權限；登錄被拒絕 <br>
ORA-01046: 無法獲得擴展上下文區域的空間 <br>
ORA-01047: 以上錯誤出現在 schema=, package=, procedure= 中 <br>
ORA-01048: ?定的上下文中無法找到指定的過程 <br>
ORA-01049: 流動 RPC 中不支持按名稱賦值 <br>
ORA-01050: 無法獲得打開上下文區域的空間 <br>
ORA-01051: 延遲 rpc 緩沖區格式無效 <br>
ORA-01052: 未指定所需的目的 LOG_ARCHIVE_DUPLEX_DEST <br>
ORA-01053: 無法讀取用戶存儲地址 <br>
ORA-01054: 無法寫入用戶存儲地址 <br>
ORA-01057: 用戶出口中引用的 block.field 無效或有歧義 <br>
ORA-01058: 內部 New Upi 接口錯誤 <br>
ORA-01059: 在賦值或執行之前進行語法分析 <br>
ORA-01060: 不允許數組賦值或執行 <br>
ORA-01061: 無法使用第 7 版客戶應用程序?動第 8 版服務器 <br>
ORA-01062: 無法分配定義緩沖區所需的內存 <br>
ORA-01070: 服務器使用 Oracle 的舊版本 <br>
ORA-01071: 無法不?動 ORACLE 而執行操作 <br>
ORA-01072: 無法停止 ORACLE；因? ORACLE 不在運行 <br>
ORA-01073: 致命的連接錯誤: 不能識別的調用類型 <br>
ORA-01074: 無法關閉 ORACLE；請首先在注冊會話中注銷 <br>
ORA-01075: 您現在已登錄 <br>
ORA-01076: 尚不支持每個進程的多次登錄 <br>
ORA-01077: 背景進程初始化失敗 <br>
ORA-01078: 處理系統?數失敗 <br>
ORA-01079: ORALCE 數據庫未正確創建，操作中止 <br>
ORA-01080: 關閉 ORACLE 時出錯 <br>
ORA-01081: 無法?動已在運行的 ORACLE --- 請首先關閉 <br>
ORA-01082: 'row_locking = always' 要求事務處理處理選項 <br>
ORA-01083: ?數 "" 的值與其它例程序的相應?數值不一致。 <br>
ORA-01084: OCI 調用中的?數無效 <br>
ORA-01085: 延遲 rpc 到 ".." 之前的錯誤 <br>
ORA-01086: 從未創建保留點 '' <br>
ORA-01087: 不能?動 ORALCE --- 現在已登錄 <br>
ORA-01088: 不能在存在活動進程時關閉 ORACLE <br>
ORA-01089: 正在進行緊急關閉 - 不允許進行任何操作 <br>
ORA-01090: 正在進行關閉 --- 不允許連接 <br>
ORA-01091: 強行?動出錯 <br>
ORA-01092: ORACLE 例程終止。強行斷開連接 <br>
ORA-01093: ALTER DATABASE CLOSE 僅允許在沒有連接會話時使用 <br>
ORA-01094: ALTER DATABASE CLOSE 正在進行。不允許連接 <br>
ORA-01095: DML 語句處理了零個行 <br>
ORA-01096: 程序版本 () 與例程 () 不兼容 <br>
ORA-01097: 無法在事務處理過程中關閉 - 首先提交或返回 <br>
ORA-01098: 在 Long Insert 過程中出現程序接口錯誤 <br>
ORA-01099: 如果在單進程模式下?動，則無法在 SHARED 模式下安裝數據庫 <br>
ORA-01100: 數據庫已安裝 <br>
ORA-01101: 要創建的數據庫當前正由其它例程安裝 <br>
ORA-01102: 無法在 EXCLUSIVE 模式下安裝數據庫 <br>
ORA-01103: 控制文件中的數據庫名 '' 不是 '' <br>
ORA-01104: 控制文件數 () 不等於  <br>
ORA-01105: 安裝與其它例程的安裝不兼容 <br>
ORA-01106: 必須在卸下之前關閉數據庫 <br>
ORA-01107: 必須安裝數據庫才可以進行介質恢复 <br>
ORA-01108: 文件  正處於備份或介質恢复過程中 <br>
ORA-01109: 數據庫未打開 <br>
ORA-01110: 數據文件 : '' <br>
ORA-01111: 數據文件  名稱未知 - 請重命名以更正文件 <br>
ORA-01112: 未?動介質恢复 <br>
ORA-01113: 文件  需要介質恢复 <br>
ORA-01114: 將塊寫入文件  時出現 IO 錯誤 (塊 # ) <br>
ORA-01115: 從文件  讀取塊時出現 IO 錯誤 (塊 # ) <br>
ORA-01116: 打開數據庫文件時出錯 <br>
ORA-01117: 對文件 '' 添加非法塊大小: ；限制?  <br>
ORA-01118: 無法添加任何其它數據庫文件: 超出限制  <br>
ORA-01119: 創建數據庫文件 '' 時出錯 <br>
ORA-01120: 無法刪除聯機數據庫文件  <br>
ORA-01121: 無法重命名數據庫文件  - 文件在使用中或在恢复中 <br>
ORA-01122: 數據庫文件  驗證失敗 <br>
ORA-01123: 無法?動聯機備份；未?用介質恢复 <br>
ORA-01124: 無法恢复數據文件  - 文件在使用中或在恢复中 <br>
ORA-01125: 無法禁用介質恢复 - 文件  設置了聯機備份 <br>
ORA-01126: 對於此操作，數據庫必須以 EXCLUSIVE 模式安裝且未打開 <br>
ORA-01127: 數據庫名 '' 超出  個字符的限制 <br>
ORA-01128: 無法?動聯機備份 - 文件  處於脫機狀態 <br>
ORA-01129: 用戶默認或臨時表空間不存在 <br>
ORA-01130: 數據庫文件版本  與 ORACLE 版本  不兼容 <br>
ORA-01131: DB_FILES 系統?數值  超出限制  <br>
ORA-01132: 數據庫文件名 '' 的長度超出  個字符的限制 <br>
ORA-01133: 日志文件名 '' 的長度超出  個字符的限制 <br>
ORA-01134: 數據庫已由其它例程獨立安裝 <br>
ORA-01135: DML/query 訪問的文件  處於脫機狀態 <br>
ORA-01136: 文件  ( 塊) 的指定大小小於  塊的原大小 <br>
ORA-01137: 數據文件  仍處於脫機過程中 <br>
ORA-01138: 數據庫必須在此例程中打開或根本沒有打開 <br>
ORA-01139: RESETLOGS 選項僅在不完全數據庫恢复後有效 <br>
ORA-01140: 無法結束聯機備份 - 所有文件均處於脫機狀態 <br>
ORA-01141: 重命名數據文件  時出錯 - 未找到新文件 '' <br>
ORA-01142: 無法結束聯機備份 - 沒有文件在備份中 <br>
ORA-01143: 不能禁用介質恢复 - 文件  需要介質恢复 <br>
ORA-01144: 文件大小 ( 塊) 超出  塊的最大數 <br>
ORA-01145: 除非?用了介質恢复，否則不允許緊急脫機 <br>
ORA-01146: 無法?動聯機備份 - 文件  已在備份中 <br>
ORA-01147: SYSTEM 表空間文件  處於脫機狀態 <br>
ORA-01149: 無法關閉 - 文件  設置了聯機備份 <br>
ORA-01150: 無法防止寫入 - 文件  設置了聯機備份 <br>
ORA-01151: 如果需要，請使用介質恢复以恢复塊和恢复備份 <br>
ORA-01152: 文件  沒有從完備的舊備份中恢复 <br>
ORA-01153: 激活了不兼容的介質恢复 <br>
ORA-01154: 數據庫正在運行。現在不允許打開, 關閉, 安裝和拆卸 <br>
ORA-01155: 正在打開, 關閉, 安裝或拆卸數據庫 <br>
ORA-01156: 進行中的恢复可能需要訪問文件 <br>
ORA-01157: 無法標識/?定數據文件  - 請?閱 DBWR 跟蹤文件 <br>
ORA-01158: 數據庫  已安裝 <br>
ORA-01159: 文件並非來自先前文件的同一數據庫 - 數據庫標識錯誤 <br>
ORA-01160: 文件不是  <br>
ORA-01161: 文件標題中的數據庫名  與?定的名稱  不匹配 <br>
ORA-01162: 文件標題中的塊大小  與配置的塊大小不匹配 <br>
ORA-01163: SIZE 子句表示  (塊)，但應與標題  匹配 <br>
ORA-01164: MAXLOGFILES 不可以超出  <br>
ORA-01165: MAXDATAFILES 不可以超出  <br>
ORA-01166: 文件數量  大於  () <br>
ORA-01167: 這兩個文件?相同的文件/組號或相同的文件 <br>
ORA-01168: 物理塊大小  與其它成員的大小  不匹配 <br>
ORA-01169: 未找到 DATAFILE 編號 1。此編號必須存在 <br>
ORA-01170: 文件未找到 '' <br>
ORA-01171: 數據文件因高級檢查點錯誤而將脫機 <br>
ORA-01172: 線程的恢复停止在塊（在文件中） <br>
ORA-01173: 數據字典指明從系統表空間丟失的數據文件 <br>
ORA-01174: DB_FILES ? ，但需要?  才能兼容 <br>
ORA-01175: 例程允許數據字典具有多於個文件 <br>
ORA-01176: 控制文件允許數據字典具有多於個文件 <br>
ORA-01177: 數據文件與字典不匹配- 可能是舊的原型 <br>
ORA-01178: 文件  在最後一個 CREATE CONTROLFILE 之前創建，無法重新創建 <br>
ORA-01179: 文件  不存在 <br>
ORA-01180: 無法創建數據文件 1 <br>
ORA-01181: 文件在最後一個 RESETLOGS 之前創建，無法重新創建 <br>
ORA-01182: 無法創建數據文件 - 文件在使用中或在恢复中 <br>
ORA-01183: 無法在 SHARED 模式下安裝數據庫 <br>
ORA-01184: 日志文件組已經存在 <br>
ORA-01185: 日志文件組號無效 <br>
ORA-01186: 文件  驗證測試失敗 <br>
ORA-01187: 由於驗證測試失敗而無法從文件  讀取 <br>
ORA-01188: 標題中的塊大小與物理塊大小不匹配 <br>
ORA-01189: 文件來自於與先前文件不同的 RESETLOGS <br>
ORA-01190: 控制文件或數據文件來自於最後一個 RESETLOGS 之前 <br>
ORA-01191: 文件已經脫機 - 無法進行正常脫機 <br>
ORA-01192: 必須?用至少一個線程 <br>
ORA-01193: 文件與恢复開始時的文件不同 <br>
ORA-01194: 文件需要更多的恢复來保持一致性 <br>
ORA-01195: 文件的聯機備份需要更多的恢复來保持一致性 <br>
ORA-01196: 文件由於介質恢复會話失敗而不一致 <br>
ORA-01197: 線程僅包含一個日志 <br>
ORA-01198: 在選項? RESETLOGS 時必須指定日志文件的大小 <br>
ORA-01199: 文件不處於聯機備份模式 <br>
ORA-01200: 的實際文件大小小於塊的正確大小 <br>
ORA-01201: 文件標題無法正確寫入 <br>
ORA-01202: 此文件的原型錯誤 - 創建時間錯誤 <br>
ORA-01203: 此文件的原型錯誤 - 創建 SCN 錯誤 <br>
ORA-01204: 文件號是而不是  - 文件錯誤 <br>
ORA-01205: 不是數據文件 - 標題的類型編號是 <br>
ORA-01206: 文件不是此數據庫的一部份 - 數據庫標識錯誤 <br>
ORA-01207: 文件比控制文件更新 - 舊的控制文件 <br>
ORA-01208: 數據文件是舊的版本 - 不能訪問當前版本 <br>
ORA-01209: 數據文件來自最後一個 RESETLOGS 之前 <br>
ORA-01210: 數據文件標題是介質損壞 <br>
ORA-01211: Oracle7 數據文件不是來自於 Oracle8 的移植版本 <br>
ORA-01212: MAXLOGMEMBERS 不可以超出 <br>
ORA-01213: MAXINSTANCES 不可以超出 <br>
ORA-01214: MAXLOGHISTORY 不可以超出 <br>
ORA-01215: ?用的線程在 CREATE CONTROLFILE 之後丟失 <br>
ORA-01216: 線程預計在 CREATE CONTROLFILE 之後禁用 <br>
ORA-01217: 日志文件成員屬於一個不同的日志文件組 <br>
ORA-01218: 日志文件成員來自於不同的時間點 <br>
ORA-01219: 數據庫未打開: 僅允許在固定表/視圖中查詢 <br>
ORA-01220: 在數據庫打開之前基於文件的分類非法 <br>
ORA-01221: 數據文件與背景進程的文件不同 <br>
ORA-01222: 的 MAXINSTANCES 要求 MAXLOGFILES 至少是而不是 <br>
ORA-01223: 必須指定 RESETLOGS 以設置新的數據庫名 <br>
ORA-01224: 標題中的組號與 GROUP 不匹配 <br>
ORA-01225: 線程編號大於 MAXINSTANCES  <br>
ORA-01226: 日志成員的文件標題與其它成員不一致 <br>
ORA-01227: 日志與其它日志不一致 <br>
ORA-01228: SET DATABASE 選項要求安裝源數據庫 <br>
ORA-01229: 數據文件與日志不一致 <br>
ORA-01230: 無法設置只讀 - 文件處於脫機狀態 <br>
ORA-01231: 無法設置讀寫 - 文件處於脫機狀態 <br>
ORA-01232: 無法?動聯機備份 - 文件是只讀文件 <br>
ORA-01233: 文件是只讀文件 - 無法使用備份控制文件恢复 <br>
ORA-01234: 無法終止文件的備份 - 文件在使用或在恢复中 <br>
ORA-01235: END BACKUP 對文件失敗而對成功 <br>
ORA-01236: 文件標題訪問的初始化過程中出現錯誤 <br>
ORA-01237: 無法擴展數據文件 <br>
ORA-01238: 無法收縮數據文件 <br>
ORA-01239: 數據庫必須在 ARCHIVELOG 模式下使用外部高速緩存 <br>
ORA-01240: 一個命令中添加的數據文件過多 <br>
ORA-01241: 外部高速緩存已停止 <br>
ORA-01242: 數據文件出現介質錯誤: 數據庫處於 NOARCHIVELOG 模式 <br>
ORA-01243: 系統表空間文件出現介質錯誤 <br>
ORA-01244: 未命名的數據文件由介質恢复添加至控制文件 <br>
ORA-01245: RESETLOGS 完成時脫機文件將丟失 <br>
ORA-01246: 通過表空間的 TSPITR 來恢复文件 <br>
ORA-01247: 通過表空間的 TSPITR 來恢复數據庫 <br>
ORA-01248: 文件在將來的不完整恢复中創建 <br>
ORA-01249: 不允許在 '克隆' 數據庫中存檔 <br>
ORA-01250: 文件標題訪問的終止過程中出現錯誤 <br>
ORA-01251: 文件號的未知文件標題版本讀取 <br>
ORA-01252: 無法禁止寫 - 文件在恢复管理器備份中 <br>
ORA-01253: 無法?動聯機備份 - 文件在恢复管理器備份中 <br>
ORA-01254: 無法結束聯機備份 - 文件在恢复管理器備份中 <br>
ORA-01255: 無法關閉 - 文件在恢复管理器備份中 <br>
ORA-01256: 在?定數據庫文件  時出錯 <br>
ORA-01257: 不能重用數據庫文件 ，文件大小未知 <br>
ORA-01258: 無法刪除臨時文件  <br>
ORA-01259: 無法刪除數據文件  <br>
ORA-01260: 當數據庫打開時, 不能發出 ALTER DATABASE END BACKUP 命令 <br>
ORA-01261: 無法轉換?數  目標字符串 <br>
ORA-01262: 在文件目標目錄上無法進行統計 <br>
ORA-01263: 文件目標目錄的名稱無效 <br>
ORA-01264: 無法創建  文件名 <br>
ORA-01265: 無法刪除文件  <br>
ORA-01266: 無法創建唯一的文件名 <br>
ORA-01267: 無法獲取日期/時間 <br>
ORA-01268: 用於變更永久性 TABLESPACE 的 TEMPFILE 子句無效 <br>
ORA-01269: 目標?數字符串過長 <br>
ORA-01270: STANDBY_PRESERVES_NAMES ? true 時, 不允許進行  操作 <br>
ORA-01271: 無法創建文件  的新文件名 <br>
ORA-01272: 只有當提供文件名時, 才允許 REUSE。 <br>
ORA-01274: 無法添加數據文件 '' - 無法創建文件 <br>
ORA-01275: 自動進行備用文件管理時, 不允許進行  操作。 <br>
ORA-01276: 無法添加文件 。  相應文件具有一個 Oracle 管理文件文件名。 <br>
ORA-01277: 文件 '' 已存在 <br>
ORA-01278: 創建文件 '' 出錯 <br>
ORA-01279: db_files 太大 <br>
ORA-01280: 嚴重的 LogMiner 錯誤。 <br>
ORA-01281: 指定的 SCN 範圍無效 <br>
ORA-01282: 指定的日期範圍無效 <br>
ORA-01283: 指定選項無效 <br>
ORA-01284: 文件  無法打開 <br>
ORA-01285: 讀取文件  時出錯 <br>
ORA-01286: 由於 DB_ID 不匹配無法添加文件   <br>
ORA-01287: 文件  來源於其他的數據庫原型 <br>
ORA-01288: 文件  來自不同的數據庫實體 <br>
ORA-01289: 無法添加重复的日志文件  <br>
ORA-01290: 無法刪除未列出的日志文件  <br>
ORA-01291: 丟失的日志文件 <br>
ORA-01292: 當前 LogMiner 會話無指定的日志文件 <br>
ORA-01293: 時間或 SCN 範圍沒有完全包含在列出的日志文件中 <br>
ORA-01294: 當處理字典文件  中的信息時出錯，可能損壞 <br>
ORA-01295: 字典  和日志文件之間的 DB_ID 不匹配 <br>
ORA-01296: 字典  和日志文件之間的字符集不匹配 <br>
ORA-01297: 字典  和日志文件之間的重做版本不匹配 <br>
ORA-01298: 字典  和最早的日志文件不是 SCN 可兼容的 <br>
ORA-01299: 字典  對應於不同的數據庫原型 <br>
ORA-01300: 字典  和最早的日志文件之間已?用的線程位向量不匹配 <br>
ORA-01301: dbms_logmnr.USE_COLMAP 只用於有效字典 <br>
ORA-01302: 在 logmnr.opt 文件中出現語法錯誤 <br>
ORA-01303: 在 logmnr.opt 文件中指定的方案  不存在 <br>
ORA-01304: 在 logmnr.opt 文件中指定的表 , 方案  不存在 <br>
ORA-01305: 在 logmnr.opt 文件中指定的列  不存在於表 ,, 方案  中 <br>
ORA-01306: 在從 v$logmnr_contents 中選擇之前必須調用 dbms_logmnr.start_logmnr() <br>
ORA-01307: 當前無活動的 LogMiner 會話 <br>
ORA-01308: 未設置初始化?數 utl_file_dir <br>
ORA-01309: 會話無效 <br>
ORA-01310: lcr_mine 函數不支持請求的返回類型 <br>
ORA-01311: mine_value 函數的調用非法 <br>
ORA-01312: 指定的表/列不存在 <br>
ORA-01313: LogMiner 字典列類型不同於指定的類型 <br>
ORA-01314: 要挖掘的列名字面上應是字符串 <br>
ORA-01315: 日志文件在選取過程中已被添加或移去 <br>
ORA-01316: 已連接到 Logminer 會話中 <br>
ORA-01317: 未連接到 Logminer 會話中 <br>
ORA-01318: Logminer 會話未?動 <br>
ORA-01319: Logminer 會話屬性無效 <br>
ORA-01320: Logminer 字典屬性無效 <br>
ORA-01321: SCN 範圍沒有完全包含在所列日志文件中 <br>
ORA-01322: 這?的表不存在 <br>
ORA-01323: 狀態無效 <br>
ORA-01324: 由於 DB_ID 匹配出錯, 無法添加文件 <br>
ORA-01325: 要構建日志流, 必須?用“歸檔日志”模式  <br>
ORA-01326: 要構建日志流, 兼容性必須大於等於 8.2 <br>
ORA-01327: 無法按構建的要求?定系統字典 (??排他?) <br>
ORA-01328: 一次只能進行一個構建操作 <br>
ORA-01329: 無法截斷所需的構建表 <br>
ORA-01330: 加載所需的構建表時出現問題 <br>
ORA-01331: 運行構建時出現一般錯誤 <br>
ORA-01332: Logminer 字典內部錯誤 <br>
ORA-01333: 無法構建 Logminer 字典 <br>
ORA-01334: logminer 字典進程上下文無效或缺失 <br>
ORA-01335: 此功能尚未實現 <br>
ORA-01336: 無法打開指定的字典文件 <br>
ORA-01337: 日志文件的兼容版本不同 <br>
ORA-01338: 其他進程已附加到 LogMiner 會話 <br>
ORA-01339: 日志文件過舊 <br>
ORA-01340: NLS error <br>
ORA-01341: LogMiner 內存不足 <br>
ORA-01342: LogMiner 由於無法暫存檢查點數據而無法恢复會話 <br>
ORA-01343: LogMiner - 遇到崩?的重做塊 <br>
ORA-01344: LogMiner 協調器已掛接 <br>
ORA-01345: 必須?用補充日志數據以納入到日志流中 <br>
ORA-01346: 從屬 LogMiner 會話依賴於存在補充性的記錄數據 <br>
ORA-01347: 未找到補充日志數據 <br>
ORA-01348: LogMiner 測試事件 <br>
ORA-01349: LogMiner 跟蹤事件 <br>
ORA-01350: 必須指定表空間名 <br>
ORA-01351: ? Logminer 字典提供的表空間不存在 <br>
ORA-01352: ? Logminer 溢出提供的表空間不存在 <br>
ORA-01353: 正在退出 Logminer 會話 <br>
ORA-01370: 指定的重? SCN 太舊 <br>
ORA-01371: 未找到完整的 LogMiner 目錄 <br>
ORA-01372: 用於指定 LogMiner 操作的進程數不足 <br>
ORA-01373: insufficient memory for staging persistent LogMiner session <br>
ORA-01374: log_parallelism greater than 1 not supported in this release <br>
ORA-01400: 無法將 NULL 插入 () <br>
ORA-01401: 插入的值對於列過大 <br>
ORA-01402: 視圖 WITH CHECK OPTIDN 違反 where 子句 <br>
ORA-01403: 未找到數據 <br>
ORA-01404: ALTER COLUMN 將使索引過大 <br>
ORA-01405: 讀取的列值? NULL <br>
ORA-01406: 讀取的列值被截斷 <br>
ORA-01407: 無法更新 () ? NULL <br>
ORA-01408: 此列列表已編制索引 <br>
ORA-01409: 不可以使用 NOSORT 選項；行不是按升序排列 <br>
ORA-01410: 無效的 ROWID <br>
ORA-01411: 無法在指示器中存儲列長度 <br>
ORA-01412: 此數據類型不允許零長度 <br>
ORA-01413: 壓縮十進制數字緩沖區中的非法值 <br>
ORA-01414: 嘗試對數組賦值時的無效數組長度 <br>
ORA-01415: 太多不同的聚組函數 <br>
ORA-01416: 兩表無法彼此外部連接 <br>
ORA-01417: 表可以外部連接到至多一個其它的表 <br>
ORA-01418: 指定的索引不存在 <br>
ORA-01419: datdts: 非法的格式代碼 <br>
ORA-01420: datstd: 非法的格式代碼 <br>
ORA-01421: datrnd/dattrn: 非法的精確度規定 <br>
ORA-01422: 實際返回的行數超出請求的行數 <br>
ORA-01423: 檢查實際讀取的多餘行時出錯 <br>
ORA-01424: 換碼符之後缺少或非法字符 <br>
ORA-01425: 換碼符必須是長度? 1 的字符串 <br>
ORA-01426: 數字溢出 <br>
ORA-01427: 單行子查詢返回多於一個行 <br>
ORA-01428: ?數''超出範圍 <br>
ORA-01429: 索引組織表: 沒有存儲溢出行段的數據段 <br>
ORA-01430: 表中已經存在要添加的列 <br>
ORA-01431: GRANT 命令中的內部不一致 <br>
ORA-01432: 要刪除的公用同義詞不存在 <br>
ORA-01433: 要創建的同義詞已經定義 <br>
ORA-01434: 要刪除的隱含同義詞不存在 <br>
ORA-01435: 用戶不存在 <br>
ORA-01436: 用戶數據中的 CONNECT BY 循環 <br>
ORA-01437: 無法連接 CONNECT BY <br>
ORA-01438: 值大於此列指定的允許精確度 <br>
ORA-01439: 要更改數據類型，則要修改的列必須?空 (empty) <br>
ORA-01440: 要減小精確度或標度，則要修改的列必須?空 (empty) <br>
ORA-01441: 無法減小列長度, 因?一些值過大 <br>
ORA-01442: 要修改? NOT NULL 的列已經是 NOT NULL <br>
ORA-01443: 內部不一致；結果視圖列中的數據類型非法 <br>
ORA-01444: 內部不一致；內部數據類型映射?無效外部類型 <br>
ORA-01445: 無法從沒有鍵值保存表的連接視圖中選擇 ROWID <br>
ORA-01446: 無法從含 DISTINCT, GROUP BY 等子句的視圖中選擇 ROWID <br>
ORA-01447: ALTER TABLE 語句無法用於聚簇列 <br>
ORA-01448: 在更改要求的類型之前必須刪除索引 <br>
ORA-01449: 列包含 NULL 值；無法將其改變? NOT NULL <br>
ORA-01450: 超出最大的關鍵字長度 () <br>
ORA-01451: 要修改? NULL 的列無法修改? NULL <br>
ORA-01452: 無法 CREATE UNIQUE INDEX；找到重复的關鍵字 <br>
ORA-01453: SET TRANSACTION 必須是事務處理的第一個語句 <br>
ORA-01454: 無法將列轉換?數值數據類型 <br>
ORA-01455: 轉換列溢出整數數據類型 <br>
ORA-01456: 不可以在 READ ONLY 事務處理中執行插入/刪除/更新操作 <br>
ORA-01457: 轉換列溢出十進制數據類型 <br>
ORA-01458: 內部變量字符串長度非法 <br>
ORA-01459: 變量字符串長度非法 <br>
ORA-01460: 轉換請求無法實現或不合理 <br>
ORA-01461: 僅可以?插入 LONG 列的 LONG 值賦值 <br>
ORA-01462: 不能插入超出 4000 個字符的文字型字符串 <br>
ORA-01463: 不能使用當前約束條件修改列數據類型 <br>
ORA-01464: 表或視圖的循環授權（授予原始授權者） <br>
ORA-01465: 無效的十六進制數字 <br>
ORA-01466: 無法讀數據 - 表定義已更改 <br>
ORA-01467: 分類 (sort) 關鍵字過長 <br>
ORA-01468: 一個謂詞只能引用一個外部連接表 <br>
ORA-01469: PRIOR 後面只能跟列名 <br>
ORA-01470: In-list 迭代不支持混合運算符 <br>
ORA-01471: 無法創建與對象同名的同義詞 <br>
ORA-01472: 無法將 CONNECT BY 用於 DISTINCT，GROUP BY 等的視圖 <br>
ORA-01473: CONNECT BY 子句中不能具有子查詢 <br>
ORA-01474: START WITH 或 PRIOR 不能沒有 CONNECT BY <br>
ORA-01475: 必須對遊標重新進行語法分析以更改賦值變量的數據類型 <br>
ORA-01476: 除數? 0 <br>
ORA-01477: 用戶數據區域描述符過大 <br>
ORA-01478: 數組賦值不可以包括任何 LONG 列 <br>
ORA-01479: 緩沖區中的最後一個字符不是 Null <br>
ORA-01480: STR 賦值變量缺少空後綴 <br>
ORA-01481: 無效的數字格式模型 <br>
ORA-01482: 不受支持的字符集 <br>
ORA-01483: DATE 或 NUMBER 賦值變量的長度無效 <br>
ORA-01484: 數組僅可以與 PL/SQL 語句關聯 <br>
ORA-01485: 編譯賦值長度不同於執行賦值長度 <br>
ORA-01486: 數組元素的大小過大 <br>
ORA-01487: ?定緩沖區的壓縮十進制數字過大 <br>
ORA-01488: 輸入數據中的無效半字節或字節 <br>
ORA-01489: 字符串連接的結果過長 <br>
ORA-01490: 無效的 ANALYZE 命令 <br>
ORA-01491: CASCADE 選項無效 <br>
ORA-01492: LIST 選項無效 <br>
ORA-01493: 指定的 SAMPLE 大小無效 <br>
ORA-01494: 指定的 SIZE 無效 <br>
ORA-01495: 未找到指定的鏈接行表 <br>
ORA-01496: 指定的鏈接行表不正確 <br>
ORA-01497: 非法的 ANALYZE CLUSTER 選項 <br>
ORA-01498: 塊檢查失敗 - 請?閱跟蹤文件 <br>
ORA-01499: 表/索引交叉引用失敗 - 請?閱跟蹤文件 <br>
ORA-01500: 無法獲得日期/時間 <br>
ORA-01501: CREATE DATABASE 失敗 <br>
ORA-01502: 索引'.'或這類索引的分區處於不可用狀態 <br>
ORA-01503: CREATE CONTROLFILE 失敗 <br>
ORA-01504: 數據庫名''與?數 db_name ''不匹配 <br>
ORA-01505: 添加日志文件時出錯 <br>
ORA-01506: 缺少或非法數據庫名 <br>
ORA-01507: 未安裝數據庫 <br>
ORA-01508: 無法創建數據庫；文件''的行出錯 <br>
ORA-01509: 指定的名稱''與實際名稱''不匹配 <br>
ORA-01510: 刪除日志文件時出錯 <br>
ORA-01511: 重命名日志/數據文件時出錯 <br>
ORA-01512: 重命名日志文件時出錯 - 未找到新文件 <br>
ORA-01513: 操作系統返回無效的當前時間 <br>
ORA-01514: 日志說明中出現錯誤: 沒有此類日志 <br>
ORA-01515: 刪除日志組時出錯: 沒有此類日志 <br>
ORA-01516: 不存在的日志文件, 數據文件或臨時文件 '' <br>
ORA-01517: 日志成員: '' <br>
ORA-01518: CREATE DATABASE 必須指定多於一個日志文件 <br>
ORA-01519: 在處理文件''的鄰近行時出錯 <br>
ORA-01520: 要添加的數據文件數 () 超出限制 <br>
ORA-01521: 添加數據文件時出錯 <br>
ORA-01522: 要重命名的文件''不存在 <br>
ORA-01523: 無法將數據文件重命名?'' - 文件已是數據庫的一部分 <br>
ORA-01524: 無法將數據文件創建?'' - 文件已是數據庫的一部分 <br>
ORA-01525: 重命名數據文件時出錯 <br>
ORA-01526: 打開文件''時出錯 <br>
ORA-01527: 讀文件出錯 <br>
ORA-01528: 處理 SQL 語句時出現 EOF <br>
ORA-01529: 關閉文件''時出錯 <br>
ORA-01530: 例程已安裝數據庫 <br>
ORA-01531: 例程已打開數據庫 <br>
ORA-01532: 無法創建數據庫；例程在他處?動 <br>
ORA-01533: 無法重命名文件''；文件不屬於表空間 <br>
ORA-01534: 回退段''不存在 <br>
ORA-01535: 回退段''已經存在 <br>
ORA-01536: 超出表空間''的空間限量 <br>
ORA-01537: 無法添加數據文件'' - 文件已是數據庫的一部分 <br>
ORA-01538: 無法獲得任何回退段 <br>
ORA-01539: 表空間''未聯機 <br>
ORA-01540: 表空間''未脫機 <br>
ORA-01541: 系統表空間無法脫機；如有必要請關閉 <br>
ORA-01542: 表空間''脫機，無法在其中分配空間 <br>
ORA-01543: 表空間 '' 已經存在 <br>
ORA-01544: 無法刪除系統回退段 <br>
ORA-01545: 指定的回退段''不可用 <br>
ORA-01546: 表空間包含活動回退段'' <br>
ORA-01547: 警告: RECOVER 成功但 OPEN RESETLOGS 將出現如下錯誤 <br>
ORA-01548: 已找到活動回退段''，終止刪除表空間 <br>
ORA-01549: 表空間非空，請使用 INCLUDING CONTENTS 選項 <br>
ORA-01550: 無法刪除系統表空間 <br>
ORA-01551: 擴展回退段，釋放用的塊 <br>
ORA-01552: 非系統表空間''無法使用系統回退段 <br>
ORA-01553: MAXEXTENTS 不得小於當前分配的區 <br>
ORA-01554: 超出事務處理表的事務處理空間 <br>
ORA-01555: 快照過舊: 回退段號  在名稱? "" 過小 <br>
ORA-01556: 回退段的 MINEXTENTS 必須大於 1 <br>
ORA-01557: 回退段的區必須至少?塊 <br>
ORA-01558: 超出回退段中的事務處理標識（號） <br>
ORA-01559: 回退段的 MAXEXTENTS 值必須大於 1 <br>
ORA-01560: LIKE ?式包含的字符不完整或非法 <br>
ORA-01561: 無法刪除指定表空間中的所有對象 <br>
ORA-01562: 擴展回退段號失敗 <br>
ORA-01563: 回退段是 PUBLIC，需要使用 PUBLIC 關鍵字 <br>
ORA-01564: 回退段不是 PUBLIC <br>
ORA-01565: 標識文件''時出錯 <br>
ORA-01566: 文件在 DROP LOGFILE 中被指定了多次 <br>
ORA-01567: 刪除日志時將在線索中保留少於兩個日志文件 <br>
ORA-01568: 無法在 PUBLIC 設置空間限量 <br>
ORA-01569: 對於系統字典表來說，數據文件過小 <br>
ORA-01570: MINEXTENTS 不得大於當前分配的區 <br>
ORA-01571: 重做版本與 ORACLE 版本不兼容 <br>
ORA-01572: 回退段 '' 無法聯機， 區已超出 <br>
ORA-01573: 正在關閉例程，不允許繼續更改 <br>
ORA-01574: 超出並發事務處理的最大數 <br>
ORA-01575: 等待空間管理資源超時 <br>
ORA-01576: 例程?定協議版本與 ORACLE 版本不兼容 <br>
ORA-01577: 無法添加日志文件'' - 文件已是數據庫的一部分 <br>
ORA-01578: ORACLE 數據塊損壞（文件號，塊號） <br>
ORA-01579: 恢复過程中出現寫錯誤 <br>
ORA-01580: 創建控制備份文件時出錯 <br>
ORA-01581: 嘗試使用已分配的回退段 () 新區 () <br>
ORA-01582: 無法打開要備份的控制文件 <br>
ORA-01583: 無法獲得要備份的控制文件的塊大小 <br>
ORA-01584: 無法獲得要備份的控制文件的文件大小 <br>
ORA-01585: 標識備份文件時出錯 <br>
ORA-01586: 無法打開要備份的目標文件 <br>
ORA-01587: 复制控制文件的備份文件時出錯 <br>
ORA-01588: 要打開數據庫則必須使用 RESETLOGS 選項 <br>
ORA-01589: 要打開數據庫則必須使用 RESETLOGS 或 NORESETLOGS 選項 <br>
ORA-01590: 段可用列表數 () 超出最大數 <br>
ORA-01591: ?定已被有問題的分配事務處理掛起 <br>
ORA-01592: 將第 7 版回退段 () 轉換? Oracle 8 版格式時出錯 <br>
ORA-01593: 回退段最佳大小 ( blks) 小於計算的初始大小 ( blks) <br>
ORA-01594: 嘗試放回已釋放的回退段 () 區 () <br>
ORA-01595: 釋放區 () 回退段 () 時出錯 <br>
ORA-01596: 無法在?數中指定系統 <br>
ORA-01597: 無法改變聯機或脫機系統回退段 <br>
ORA-01598: 回退段''未聯機 <br>
ORA-01599: 無法獲得回退段 (), 高速緩存空間已滿 <br>
ORA-01600: 至多只有一個""在子句""（）中 <br>
ORA-01601: 子句""（）中的存儲桶大小非法 <br>
ORA-01603: 子句""（）中的分組大小非法 <br>
ORA-01604: 子句""（）中的編號範圍非法 <br>
ORA-01605: 子句""（）中缺少編號 <br>
ORA-01606: gc_files_to_locks 不同於另一已安裝例程的?數 <br>
ORA-01608: 無法將回退段''聯機，其狀態? () <br>
ORA-01609: 日志是線程的當前日志 - 無法刪除成員 <br>
ORA-01610: 使用 BACKUP CONTROLFILE 選項的恢复必須已完成 <br>
ORA-01611: 線程編號無效 - 必須介於 1 和之間 <br>
ORA-01612: 線程已經?用 <br>
ORA-01613: 線程只有日志 - 要求至少?用 2 個日志 <br>
ORA-01614: 線程正忙 - 無法?用 <br>
ORA-01615: 線程已安裝 - 無法禁用 <br>
ORA-01616: 線程已打開 - 無法禁用 <br>
ORA-01617: 無法安裝:  不是有效的線程編號 <br>
ORA-01618: 線程未?用 - 無法安裝 <br>
ORA-01619: 線程已由另一例程安裝 <br>
ORA-01620: 沒有可用於安裝的公用線程 <br>
ORA-01621: 數據庫打開時無法重命名當前日志的成員 <br>
ORA-01622: 必須指定線程編號 - 沒有特定默認值 <br>
ORA-01623: 日志是線程的當前日志 - 無法刪除 <br>
ORA-01624: 線程的緊急恢复需要日志 <br>
ORA-01625: 回退段''不屬於此例程 <br>
ORA-01626: 回退段號''無法處理更多事務處理 <br>
ORA-01627: 回退段號''未聯機 <br>
ORA-01628: 已達到 max # extents ()（回退段）  <br>
ORA-01629: 已達到 max # extents ()，此時正在保存表空間的撤消 <br>
ORA-01630: 表空間中的 temp 段達到 max # extents() <br>
ORA-01631: 表.達到 max # extents () <br>
ORA-01632: 索引.達到 max # extents () <br>
ORA-01633: 此操作需要 Real Application Clusters 選件 <br>
ORA-01634: 回退段號''即將脫機 <br>
ORA-01635: 指定的回退段編號 '' 不可用 <br>
ORA-01636: 回退段''已聯機 <br>
ORA-01637: 回退段''正被另一例程 (#) 使用 <br>
ORA-01638: ?數  不允許 ORACLE 版本  裝載群集數據庫 <br>
ORA-01640: 無法將活動事務處理的表空間設置?只讀 <br>
ORA-01641: 表空間''未聯機- 無法添加數據文件 <br>
ORA-01642: 只讀表空間''無需開始備份 <br>
ORA-01643: 系統表空間無法設置?只讀 <br>
ORA-01644: 表空間''已經是只讀 <br>
ORA-01645: 上次嘗試設置讀寫已完成一半 <br>
ORA-01646: 表空間''不是只讀 - 無法設置?讀寫 <br>
ORA-01647: 表空間''是只讀，無法在其中分配空間 <br>
ORA-01648: 日志是禁用線程的當前日志 <br>
ORA-01649: 不允許進行備份控制文件操作 <br>
ORA-01650: 回退段無法通過（在表空間中）擴展 <br>
ORA-01651: 無法通過（在表空間中）擴展保存撤消段 <br>
ORA-01652: 無法通過（在表空間中）擴展 temp 段 <br>
ORA-01653: 表.無法通過（在表空間中）擴展 <br>
ORA-01654: 索引.無法通過（在表空間中）擴展 <br>
ORA-01655: 群集 . 無法通過  (在表空間  中) 擴展 <br>
ORA-01656: 最大區數 () 已在群集 . 中達到 <br>
ORA-01657: 無效的 SHRINK 選項值 <br>
ORA-01658: 無法?表空間中的段創建 INITIAL 區 <br>
ORA-01659: 無法分配超出的 MINEXTENTS（在表空間中） <br>
ORA-01660: 表空間''已是永久性 <br>
ORA-01661: 表空間''已是臨時性 <br>
ORA-01662: 表空間''非空且無法設置?暫時性 <br>
ORA-01663: 表空間''的內容不斷變動 <br>
ORA-01664: 擴展排序段的事務處理已終止 <br>
ORA-01665: 控制文件不是一個備用控制文件 <br>
ORA-01666: 控制文件用於備用數據庫 <br>
ORA-01667: 無法添加任何其它表空間: 超出限制 <br>
ORA-01668: 對於數據文件的脫機，備用數據庫要求使用 DROP 選項 <br>
ORA-01669: 備用數據庫控制文件不一致 <br>
ORA-01670: 備用數據庫恢复需要新數據文件 <br>
ORA-01671: 控制文件是備份文件，無法設置備用控制文件 <br>
ORA-01672: 控制文件可能缺少文件或具有額外文件 <br>
ORA-01673: 未標識數據文件 <br>
ORA-01674: 數據文件是一個舊的原型而非當前文件 <br>
ORA-01675: max_commit_propagation_delay 與其它例程不一致 <br>
ORA-01676: ''的備用文件名轉換超出的最大長度 <br>
ORA-01677: 備用文件名轉換?數不同於其它例程 <br>
ORA-01678: ?數  必須是一對?式字符串和取代字符串 <br>
ORA-01679: 數據庫必須以 EXCLUSIVE 安裝且未打開以激活 <br>
ORA-01680: 無法通過（在表空間中）擴展 LOB 段 <br>
ORA-01681: max # extents () 已在表空間中的 LOB 段達到 <br>
ORA-01682: 只讀 DB 無法在表空間中分配臨時空間 <br>
ORA-01683: 索引.分區無法通過（在表空間中）擴展 <br>
ORA-01684: max # extents () 已在表.分區中達到 <br>
ORA-01685: max # extents () 已在索引.分區中達到 <br>
ORA-01686: max # files () 對於表空間已達到 <br>
ORA-01687: 表空間''的指定記錄屬性與現有屬性相同 <br>
ORA-01688: 表.分區無法通過（在表空間中）擴展 <br>
ORA-01689: 子句""（）中出現語法錯誤 <br>
ORA-01690: 排序區太小 <br>
ORA-01691: Lob 段.無法通過（在表空間中）擴展 <br>
ORA-01692: Lob 段.分區無法通過（在表空間中）擴展 <br>
ORA-01693: max # extents () 已在 lob 段.中達到 <br>
ORA-01694: max # extents () 已在 lob 段.分區中達到 <br>
ORA-01695: 將回退段轉換?版本 8.0.2 時出錯 <br>
ORA-01696: 控制文件不是 '克隆' 控制文件 <br>
ORA-01697: 控制文件用於 '克隆' 數據庫 <br>
ORA-01698: '克隆' 數據庫僅可以具有 SYSTEM 聯機回退段 <br>
ORA-01699: 正在導入表空間''以用於時間點恢复 <br>
ORA-01700: 列表中的用戶名重复 <br>
ORA-01701: 此處不允許有群集 <br>
ORA-01702: 此處不允許有視圖 <br>
ORA-01703: 缺少 SYNONYM 關鍵字 <br>
ORA-01704: 文字字符串過長 <br>
ORA-01705: 無法在關聯列中指定外部連接 <br>
ORA-01706: 用戶函數的結果值過大 <br>
ORA-01707: 缺少 LIST 關鍵字 <br>
ORA-01708: 需要 ACCESS 或 SESSION <br>
ORA-01709: 程序不存在 <br>
ORA-01710: 缺少 OF 關鍵字 <br>
ORA-01711: 列出的權限重复 <br>
ORA-01712: 您不能授予不具有的權限 <br>
ORA-01713: 該權限的 GRANT OPTION 不存在 <br>
ORA-01714: 執行用戶函數時出錯 <br>
ORA-01715: UNIQUE 不可以與簇索引一起使用 <br>
ORA-01716: NOSORT 不可以與簇索引一起使用 <br>
ORA-01717: seccta: 訪問已過時的模式標記無效 <br>
ORA-01718: NOAUDIT 不允許 BY ACCESS | SESSION 子句 <br>
ORA-01719: OR 或 IN 操作數中不允許外部連接運算符 (+) <br>
ORA-01720: 授權選項對於'.'不存在 <br>
ORA-01721: USERENV(COMMITSCN) 在事務處理中調用了多次 <br>
ORA-01722: 無效數字 <br>
ORA-01723: 不允許長度? 0 的列 <br>
ORA-01724: 浮點（數）精確度超出範圍（1 到 126） <br>
ORA-01725: 此處不允許 USERENV('COMMITSCN') <br>
ORA-01726: 此處不允許有表 <br>
ORA-01727: 數字精度說明符超出範圍（1 到 38） <br>
ORA-01728: 數字標度說明符超出範圍（-84 到 127） <br>
ORA-01729: 需要數據庫鏈接名 <br>
ORA-01730: 指定的列名數無效 <br>
ORA-01731: 出現循環的視圖定義 <br>
ORA-01732: 此視圖的數據操縱操作非法 <br>
ORA-01733: 此處不允許虛擬列 <br>
ORA-01734: 非法的?數 - EXTENT MIN 高於 EXTENT MAX <br>
ORA-01735: 非法的 ALTER TABLE 選項 <br>
ORA-01736: 需要 [NOT] SUCCESSFUL <br>
ORA-01737: 有效模式: [ROW] SHARE, [[SHARE] ROW] EXCLUSIVE, SHARE UPDATE <br>
ORA-01738: 缺少 IN 關鍵字 <br>
ORA-01739: 缺少 MODE 關鍵字 <br>
ORA-01740: 標識中缺少雙引號 <br>
ORA-01741: 非法的零長度標識 <br>
ORA-01742: 備注錯誤終止 <br>
ORA-01743: 僅能編制純函數的索引 <br>
ORA-01744: 不合理的 INTO <br>
ORA-01745: 無效的主機/賦值變量名 <br>
ORA-01746: 此處不允許指示符變量 <br>
ORA-01747: 無效的用戶.表.列，表.列，或列規格 <br>
ORA-01748: 此處只允許簡單的列名 <br>
ORA-01749: 用戶不可以自/至自己 GRANT/REVOKE 權限 <br>
ORA-01750: UPDATE/REFERENCES 僅可以從整個表而不能按列 REVOKE <br>
ORA-01751: 無效的轉儲撤消選項 <br>
ORA-01752: 不能從沒有一個鍵值保存表的視圖中刪除 <br>
ORA-01753: 列定義與聚簇列定義不兼容 <br>
ORA-01754: 表只能包含一個 LONG 類型的列 <br>
ORA-01755: 必須指定區編號或塊編號 <br>
ORA-01756: 括號內的字符串沒有正確結束 <br>
ORA-01757: 必須指定對象編號 <br>
ORA-01758: 要添加法定 (NOT NULL) 列，則表必須?空 <br>
ORA-01759: 未正確定義用戶函數 <br>
ORA-01760: 函數的?數非法 <br>
ORA-01761: DML 操作與連結中的唯一表不對應 <br>
ORA-01762: vopdrv: FROM 中沒有視圖查詢塊 <br>
ORA-01763: 更新或刪除涉及到外部連結表 <br>
ORA-01764: 連結的新更新值不能保證?唯一 <br>
ORA-01765: 不允許指定表的所有者名 <br>
ORA-01766: 此上下文中不允許有字典表 <br>
ORA-01767: UPDATE ...SET 表達式必須是子查詢 <br>
ORA-01768: 數字字符串過長 <br>
ORA-01769: 重复的 CLUSTER 選項說明 <br>
ORA-01770: CREATE CLUSTER 命令中不允許有 CLUSTER 選項 <br>
ORA-01771: 選項對聚簇表非法 <br>
ORA-01772: 必須指定 LEVEL 的值 <br>
ORA-01773: 此 CERATE TABLE 中沒有指定列的數據類型 <br>
ORA-01774: 轉儲撤消選項指定了多次 <br>
ORA-01775: 同義詞的循環嵌套鏈 <br>
ORA-01776: 無法通過連接視圖修改多個基表 <br>
ORA-01777: 此系統中不允許 WITH GRANT OPTION <br>
ORA-01778: 超出最大子查詢的嵌套層 <br>
ORA-01779: 無法修改與非鍵值保存表對應的列 <br>
ORA-01780: 要求文字字符串 <br>
ORA-01781: UNRECOVERABLE 不能指定沒有 AS SELECT <br>
ORA-01782: 不能?群集或聚簇表指定 UNRECOVERABLE <br>
ORA-01783: 只可以指定 RECOVERABLE 或 UNRECOVERABLE 子句 <br>
ORA-01784: 不能指定 RECOVERABLE 具有禁用的數據庫介質恢复 <br>
ORA-01785: ORDER BY 項必須是 SELECT-list 表達式的數目 <br>
ORA-01786: 此查詢表達式不允許 FOR UPDATE <br>
ORA-01787: 每個查詢塊只允許有一個子句 <br>
ORA-01788: 此查詢塊中要求 CONNECT BY 子句 <br>
ORA-01789: 查詢塊具有不正確的結果列數 <br>
ORA-01790: 表達式必須具有與對應表達式相同的數據類型 <br>
ORA-01791: 不是 SELECTed 表達式 <br>
ORA-01792: 表或視圖中的最大列數? 1000 <br>
ORA-01793: 索引列的最大數? 32 <br>
ORA-01794: 群集列的最大數目? 32 <br>
ORA-01795: 列表中的最大表達式數? 1000 <br>
ORA-01796: 此運算符不能與列表一起使用 <br>
ORA-01797: 此運算符後面必須跟 ANY 或 ALL <br>
ORA-01798: 缺少 EXCEPTION 關鍵字 <br>
ORA-01799: 列不可以外部連接到子查詢 <br>
ORA-01800: 日期格式中的文字過長以致無法處理 <br>
ORA-01801: 日期格式對於內部緩沖區過長 <br>
ORA-01802: Julian 日期超出範圍 <br>
ORA-01803: 無法獲得日期/時間 <br>
ORA-01804: 時區信息無法初始化 <br>
ORA-01810: 格式代碼出現兩次 <br>
ORA-01811: Julian 日期導致年度中的日無法使用 <br>
ORA-01812: 只可以指定一次年度 <br>
ORA-01813: 只可以指定一次小時 <br>
ORA-01814: AM/PM 因使用 A.M./P.M. 而發生沖突 <br>
ORA-01815: BC/AD 因使用 B.C./A.D. 而發生沖突 <br>
ORA-01816: 只可以指定一次月份 <br>
ORA-01817: 只可以指定一次周中的日 <br>
ORA-01818: 'HH24' 導致上下午指示符無法使用 <br>
ORA-01819: 帶符號的年度導致 BC/AD 無法使用 <br>
ORA-01820: 格式代碼無法以日期輸入格式顯示 <br>
ORA-01821: 日期格式無法識別 <br>
ORA-01822: 此日曆的紀元格式代碼無效 <br>
ORA-01830: 日期格式圖片在轉換整個輸入字符串之前結束 <br>
ORA-01831: 年度與 Julian 日期發生沖突 <br>
ORA-01832: 年度中的日與 Julian 日期發生沖突 <br>
ORA-01833: 月份與 Julian 日期發生沖突 <br>
ORA-01834: 月份中的日與 Julian 日期發生沖突 <br>
ORA-01835: 周中的日與 Julian 日期發生沖突 <br>
ORA-01836: 小時與日中的秒發生沖突 <br>
ORA-01837: 小時中的分與日中的秒發生沖突 <br>
ORA-01838: 分中的秒與日中的秒發生沖突 <br>
ORA-01839: 指定月份的日期無效 <br>
ORA-01840: 輸入值對於日期格式不夠長 <br>
ORA-01841: （全）年度值必須介於 -4713 和 +9999 之間，且不? 0 <br>
ORA-01842: 季度值必須介於 1 和 4 之間 <br>
ORA-01843: 無效的月份 <br>
ORA-01844: 年度中的周值必須介於 1 和 52 之間 <br>
ORA-01845: 月份中的周值必須介於 1 和 5 之間 <br>
ORA-01846: 周中的日無效 <br>
ORA-01847: 月份中日的值必須介於 1 和當月最後一日之間 <br>
ORA-01848: 年度中的日值必須介於 1 和 365 之間（閏年? 366） <br>
ORA-01849: 小時值必須介於 1 和 12 之間 <br>
ORA-01850: 小時值必須介於 0 和 23 之間 <br>
ORA-01851: 分?值必須介於 0 和 59 之間 <br>
ORA-01852: 秒值必須介於 0 和 59 之間 <br>
ORA-01853: 日中的秒值必須介於 0 和 86399 之間 <br>
ORA-01854: julian 日期必須介於 1 和 5373484 之間 <br>
ORA-01855: 要求 AM/A.M. 或 PM/P.M. <br>
ORA-01856: 要求 BC/B.C. 或 AD/A.D. <br>
ORA-01857: 無效的時區 <br>
ORA-01858: 在要求輸入數字處找到非數字字符 <br>
ORA-01859: 在要求輸入字母處找到非字母字符 <br>
ORA-01860: 年度中的周值必須介於 1 和 53 之間 <br>
ORA-01861: 文字與格式字符串不匹配 <br>
ORA-01862: 數字值與格式項目的長度不匹配 <br>
ORA-01863: 年度不支持當前日曆 <br>
ORA-01864: 日期超出當前日曆的範圍 <br>
ORA-01865: 無效的紀元 <br>
ORA-01866: 日期時間類無效 <br>
ORA-01867: 間隔無效 <br>
ORA-01868: 間隔的前導精度太小 <br>
ORA-01869: 保留以供將來使用 <br>
ORA-01870: 間隔或日期時間不是相互可比較的 <br>
ORA-01871: 秒數必須少於 60 <br>
ORA-01872: 保留以供將來使用 <br>
ORA-01873: 間隔的前導精度太小 <br>
ORA-01874: 時區小時必須在 -12 和 13 之間 <br>
ORA-01875: 時區分?必須在 -59 和 59 之間 <br>
ORA-01876: 年份必須不少於 -4713 <br>
ORA-01877: 內部緩沖區的字符串太長 <br>
ORA-01878: 在日期時間或間隔中沒有找到指定的字段 <br>
ORA-01879: hh25 字段必須在 0 和 24 之間 <br>
ORA-01880: 零點幾秒必須在 0 和 999999999 之間 <br>
ORA-01881: 時區區域 ID %d 無效 <br>
ORA-01882: 未找到時區區域   <br>
ORA-01883: 在區域轉換過程中禁用了重? <br>
ORA-01890: 檢測到 NLS 錯誤 <br>
ORA-01891: 日期時間/間隔內部錯誤 <br>
ORA-01898: 精確度說明符過多 <br>
ORA-01899: 錯誤的精度說明符 <br>
ORA-01900: 需要 LOGFILE 關鍵字 <br>
ORA-01901: 需要 ROLLBACK 關鍵字 <br>
ORA-01902: 需要 SEGMENT 關鍵字 <br>
ORA-01903: 需要 EVENTS 關鍵字 <br>
ORA-01904: 需要 DATAFILE 關鍵字 <br>
ORA-01905: 需要 STORAGE 關鍵字 <br>
ORA-01906: 需要 BACKUP 關鍵字 <br>
ORA-01907: 需要 TABLESPACE 關鍵字 <br>
ORA-01908: 需要 EXISTS 關鍵字 <br>
ORA-01909: 需要 REUSE 關鍵字 <br>
ORA-01910: 需要 TABLES 關鍵字 <br>
ORA-01911: 需要 CONTENTS 關鍵字 <br>
ORA-01912: 需要 ROW 關鍵字 <br>
ORA-01913: 需要 EXCLUSIVE 關鍵字 <br>
ORA-01914: 審計選項對於序號無效 <br>
ORA-01915: 審計選項對於視圖無效 <br>
ORA-01917: 用戶或角色 '' 不存在 <br>
ORA-01918: 用戶''不存在 <br>
ORA-01919: 角色''不存在 <br>
ORA-01920: 用戶名''與另外一個用戶名或角色名發生沖突 <br>
ORA-01921: 角色名''與另一個用戶名或角色名發生沖突 <br>
ORA-01922: 必須指定 CASCADE 以刪除'' <br>
ORA-01923: CASCADE 已中止，對象被另一用戶?定 <br>
ORA-01924: 角色''未被授權或不存在 <br>
ORA-01925: 超出已?用角色的最大數 <br>
ORA-01926: 無法將 WITH GRANT OPTION GRANT 角色 <br>
ORA-01927: 無法 REVOKE 您未授權的權限 <br>
ORA-01928: 未對 GRANT 選項授權所有權限 <br>
ORA-01929: 沒有要 GRANT 的權限 <br>
ORA-01930: 不支持審計對象 <br>
ORA-01931: 無法將授予角色 <br>
ORA-01932: ADMIN 選項未授權?角色'' <br>
ORA-01933: 無法使用角色權限來創建存儲對象 <br>
ORA-01934: 檢測到循環的角色授權 <br>
ORA-01935: 缺少用戶或角色名 <br>
ORA-01936: 不能在創建用戶或角色時指定所有者 <br>
ORA-01937: 缺少或無效的角色名 <br>
ORA-01938: 必須? CREATE USER 指定 IDENTIFIED BY <br>
ORA-01939: 只可以指定 ADMIN OPTION <br>
ORA-01940: 無法刪除當前已連接的用戶 <br>
ORA-01941: 需要 SEQUENCE 關鍵字 <br>
ORA-01942: 無法同時指定 IDENTIFIED BY 和 EXTERNALLY <br>
ORA-01943: 已經指定 IDENTIFIED BY <br>
ORA-01944: 已經指定 IDENTIFIED EXTERNALLY <br>
ORA-01945: 已經指定 DEFAULT ROLE[S] <br>
ORA-01946: 已經指定 DEFAULT TABLESPACE <br>
ORA-01947: 已經指定 TEMPORARY TABLESPACE <br>
ORA-01948: 標識符的名稱長度 () 超過最大長度 () <br>
ORA-01949: 需要 ROLE 關鍵字 <br>
ORA-01950: 表空間''中無權限 <br>
ORA-01951: ROLE ''未授予'' <br>
ORA-01952: 系統權限未授予'' <br>
ORA-01953: 命令不再有效，請?閱 ALTER USER <br>
ORA-01954: DEFAULT ROLE 子句對 CREATE USER 無效 <br>
ORA-01955: DEFAULT ROLE ''未授予用戶 <br>
ORA-01956: 使用 OS_ROLES 時命令無效 <br>
ORA-01957: 需要的 MIN 或 MAX 關鍵字未找到 <br>
ORA-01958: 必須? LAYER 選項提供整數 <br>
ORA-01959: 必須? OPCODE 選項提供整數 <br>
ORA-01960: 無效的轉儲日志文件選項 <br>
ORA-01961: 無效的轉儲選項 <br>
ORA-01962: 必須指定文件號或日志序號 <br>
ORA-01963: 必須指定塊編號 <br>
ORA-01964: 必須? TIME 選項指定時間 <br>
ORA-01965: 必須指定 PERIOD <br>
ORA-01967: 無效的 CREATE CONTROLFILE 選項 <br>
ORA-01968: 僅指定 RESETLOGS 或 NORESETLOGS 一次 <br>
ORA-01969: 您必須指定 RESETLOGS 或 NORESETLOGS <br>
ORA-01970: 您必須? CREATE CONTROLFILE 指定數據庫名 <br>
ORA-01971: 非法的 ALTER TRACING 選項 <br>
ORA-01972: 必須? ALTER TRACING ENABLE 或 DISABLE 指定字符串 <br>
ORA-01973: 缺少更改編號 <br>
ORA-01974: 非法的存檔選項 <br>
ORA-01975: 更改編號中的字符非法 <br>
ORA-01976: 缺少更改編號 <br>
ORA-01977: 缺少線程編號 <br>
ORA-01978: 缺少序號 <br>
ORA-01979: 角色''缺少口令或口令無效 <br>
ORA-01980: OS ROLE 初始化過程中出錯 <br>
ORA-01981: 必須指定 CASCADE CONSTRAINTS 以執行此撤消 <br>
ORA-01982: 審計選項對於視圖無效 <br>
ORA-01983: 無效的 DEFAULT 審計選項 <br>
ORA-01984: 無效的程序/程序包/函數審計選項 <br>
ORA-01985: 因超出 LICENSE_MAX_USERS ?數而無法創建用戶 <br>
ORA-01986: 無效的 OPTIMIZER_GOAL 選項 <br>
ORA-01987: 客戶 OS 用戶名過長 <br>
ORA-01988: 不允許遠程 os 登錄 <br>
ORA-01989: 操作系統未授權角色'' <br>
ORA-01990: 打開口令文件''時出錯 <br>
ORA-01991: 無效的口令文件'' <br>
ORA-01992: 關閉口令文件''時出錯 <br>
ORA-01993: 寫口令文件''時出錯 <br>
ORA-01994: GRANT 失敗: 無法添加用戶至公用口令文件 <br>
ORA-01995: 讀口令文件''時出錯 <br>
ORA-01996: GRANT 失敗: 口令文件''已滿 <br>
ORA-01997: GRANT 失敗: 用戶''由外部標識 <br>
ORA-01998: REVOKE 失敗: 用戶 SYS 始終具有 SYSOPER 和 SYSDBA <br>
ORA-01999: 口令文件模式已由''更改?'' <br>
ORA-02000: 缺少關鍵字 <br>
ORA-02001: 用戶 SYS 不允許創建可用列表組的索引 <br>
ORA-02002: 寫入審記線索時出錯 <br>
ORA-02003: 無效的 USERENV ?數 <br>
ORA-02004: 違反安全性 <br>
ORA-02005: 隱含 (-1) 長度對數據類型的定義和賦值無效 <br>
ORA-02006: 無效的壓縮十進制格式字符串 <br>
ORA-02007: 不能使用含 REBUILD 的 ALLOCATE 或 DEALLOCATE 選項 <br>
ORA-02008: 已指定非數字列的非零標度 <br>
ORA-02009: 指定的文件大小不得? 0 <br>
ORA-02010: 缺少主機連接字符串 <br>
ORA-02011: 重复的數據庫鏈接名 <br>
ORA-02012: 缺少 USING 關鍵字 <br>
ORA-02013: 缺少 CONNECT 關鍵字 <br>
ORA-02014: 不能從具有 DISTINCT, GROUP BY 等的視圖選擇 UPDATE FOR <br>
ORA-02015: 不能從遠程表選擇 FOR UPDATE <br>
ORA-02016: 不能在遠程數據庫中使用 START WITH 子查詢 <br>
ORA-02017: 要求整數值 <br>
ORA-02018: 同名的數據庫鏈接具有開放連接 <br>
ORA-02019: 未找到遠程數據庫的連接說明 <br>
ORA-02020: 過多的數據庫鏈接在使用中 <br>
ORA-02021: 不允許對遠程數據庫進行 DDL 操作 <br>
ORA-02022: 遠程語句的遠程對象具有未優化的視圖 <br>
ORA-02023: 遠程數據庫無法對 START WITH 或 CONNECT BY 謂詞求值 <br>
ORA-02024: 未找到數據庫鏈接 <br>
ORA-02025: SQL 語句的所有表均必須在遠程數據庫中 <br>
ORA-02026: 缺少 LINK 關鍵字 <br>
ORA-02027: 不支持 LONG 列的多行 UPDATE <br>
ORA-02028: 服務器不支持行數的准確讀取 <br>
ORA-02029: 缺少 FLLE 關鍵字 <br>
ORA-02030: 只能從固定的表/視圖查詢 <br>
ORA-02031: 沒有 ROWID 适用於固定表或外部組織的表 <br>
ORA-02032: 聚簇表無法在簇索引建立之前使用 <br>
ORA-02033: 此簇的簇索引已經存在 <br>
ORA-02034: 不允許加速賦值 <br>
ORA-02035: 非法的成組操作組合 <br>
ORA-02036: 自動遊標打開的變量描述過多 <br>
ORA-02037: 未初始化的加速賦值存儲 <br>
ORA-02038: 不允許對數組類型定義 <br>
ORA-02039: 不允許對數組類型賦值 <br>
ORA-02040: 遠程數據庫不支持兩段式提交 <br>
ORA-02041: 客戶數據庫未開始一個事務處理 <br>
ORA-02042: 分布式事務處理過多 <br>
ORA-02043: 必須在執行之前結束當前事務處理 <br>
ORA-02044: 事務處理管理器登錄被拒絕: 事務處理正在進行 <br>
ORA-02045: 全局事務處理中的本地會話過多 <br>
ORA-02046: 分布式事務處理已經開始 <br>
ORA-02047: 無法連接運行中的分布式事務處理 <br>
ORA-02048: 嘗試不登錄而開始分布式事務處理 <br>
ORA-02049: 超時: 分布式事務處理等待?定 <br>
ORA-02050: 事務處理已重算，某些遠程 DBs 可能有問題 <br>
ORA-02051: 同一事務處理中的另一會話失敗 <br>
ORA-02052: 遠程事務處理在失敗 <br>
ORA-02053: 事務處理已提交，某些遠程 DBs 可能有問題 <br>
ORA-02054: 事務處理有問題 <br>
ORA-02055: 分布式更新操作失效；要求回退 <br>
ORA-02056: 2PC: : 無效的兩段命令編號（源於） <br>
ORA-02057: 2PC: : 無效的兩段恢复狀態編號（源於） <br>
ORA-02058: 未找到 ID的准備事務處理 <br>
ORA-02059: ORA-2PC-CRASH-TEST- 在提交備注中 <br>
ORA-02060: 選擇指定了分布表連接的更新 <br>
ORA-02061: ?定表指定了分布式表的列表 <br>
ORA-02062: 分布式恢复收到 DBID ，預計? <br>
ORA-02063: 緊接?（源於） <br>
ORA-02064: 不支持分布式操作 <br>
ORA-02065: 非法的 ALTER SYSTEM 選項 <br>
ORA-02066: DISPATCHERS 文本缺失或無效 <br>
ORA-02067: 要求事務處理或保存點回退 <br>
ORA-02068: 以下嚴重錯誤源於 <br>
ORA-02069: 此操作的 global_names ?數必須設置? TRUE <br>
ORA-02070: 數據庫不支持此上下文中的 <br>
ORA-02071: 初始化遠程數據庫的功能時出錯 <br>
ORA-02072: 分布式數據庫網?協議匹配錯誤 <br>
ORA-02073: 遠程更新中不支持序號 <br>
ORA-02074: 無法在分布式事務處理中 <br>
ORA-02075: 另一例程已更改事務處理的狀態 <br>
ORA-02076: 序列與更新表或 long 列位於不同的地方 <br>
ORA-02077: 選擇的 long 列必須來自於同一地方的表 <br>
ORA-02078: ALTER SYSTEM FIXED_DATE 的設置無效 <br>
ORA-02079: 沒有新的會話可與提交的分布式事務處理連接 <br>
ORA-02080: 數據庫鏈接正在使用中 <br>
ORA-02081: 數據庫鏈接未打開 <br>
ORA-02082: 回送數據庫鏈接必須具有連結限定詞 <br>
ORA-02083: 數據庫名稱含有非法字符 '' <br>
ORA-02084: 數據庫名不全 <br>
ORA-02085: 數據庫鏈接與相連結 <br>
ORA-02086: 數據庫 (鏈路) 名過長 <br>
ORA-02087: 對象被同一事務處理的另一進程?定 <br>
ORA-02088: 未安裝分布式數據庫選項 <br>
ORA-02089: COMMIT 不允許在附屬會話中 <br>
ORA-02090: 網?錯誤: 試圖 callback+passthru <br>
ORA-02091: 事務處理已重算 <br>
ORA-02092: 超出分布式事務處理的事務處理表槽 <br>
ORA-02093: TRANSACTIONS_PER_ROLLBACK_SEGMENT() 大於最大的可能數 () <br>
ORA-02094: 未安裝复制選項 <br>
ORA-02095: 無法修改指定的初始化?數 <br>
ORA-02096: 此選項的指定初始化?數不可修改 <br>
ORA-02097: 無法修改?數，因?指定的值無效 <br>
ORA-02098: 對索引表引用 (: I) 進行語法分析時出錯 <br>
ORA-02099: 內部使用，不得打印 <br>
ORA-02100: PCC: 內存不足 (如無法分配) <br>
ORA-02101: PCC: 不一致的遊標高速緩存 (uce/cuc 不匹配) <br>
ORA-02102: PCC: 不一致的遊標高速緩存 (此 uce 無 cur 條目) <br>
ORA-02103: PCC: 不一致的遊標高速緩存 (超出 cuc 的引用範圍) <br>
ORA-02104: PCC: 不一致的主高速緩存 (cuc 不可用) <br>
ORA-02105: PCC: 不一致的遊標高速緩存 (高速緩存中無 cuc 條目) <br>
ORA-02106: PCC: 不一致的遊標高速緩存 (OraCursor nr 已壞) <br>
ORA-02107: PCC: 對運行時庫來說此程序過舊: 請重新對其編譯 <br>
ORA-02108: PCC: 無效的描述符傳送?運行時庫 <br>
ORA-02109: PCC: 不一致的主高速緩存 (超出位置引用範圍) <br>
ORA-02110: PCC: 不一致的主高速緩存 (無效的 sqi 類型) <br>
ORA-02111: PCC: 堆棧 (Heap) 一致性錯誤 <br>
ORA-02112: PCC: SELECT..INTO 返回過多行 <br>
ORA-02140: 無效的表空間名稱 <br>
ORA-02141: 無效的 OFFLINE 選項 <br>
ORA-02142: 缺少或無效的 ALTER TABLESPACE 選項 <br>
ORA-02143: 無效的 STORAGE 選項 <br>
ORA-02144: 未指定 ALTER CLUSTER 的選項 <br>
ORA-02145: 缺少 STORAGE 選項 <br>
ORA-02146: SHARED 指定了多次 <br>
ORA-02147: 與 SHARED/EXCLUSIVE 選項沖突 <br>
ORA-02148: EXCLUSIVE 指定了多次 <br>
ORA-02149: 指定的分區不存在 <br>
ORA-02153: 無效的 VALUES 口令字符串 <br>
ORA-02155: 無效的 DEFAULT 表空間標識 <br>
ORA-02156: 無效的 TEMPORARY 表空間標識 <br>
ORA-02157: 未指定 ALTER USER 的選項 <br>
ORA-02158: 無效的 CREATE INDEX 選項 <br>
ORA-02159: 安裝的 DLM 不支持可釋放?定模式 <br>
ORA-02160: 索引編排表不能包含 LONG 類型的列 <br>
ORA-02161: MAXLOGFILES 值無效 <br>
ORA-02162: MAXDATAFILES 值無效 <br>
ORA-02163: FREELIST GROUPS 值無效 <br>
ORA-02164: DATAFILE 子句指定了多次 <br>
ORA-02165: 無效的 CREATE DATABASE 選項 <br>
ORA-02166: 已指定 ARCHIVELOG 和 NOARCHIVELOG <br>
ORA-02167: LOGFILE 子句指定了多次 <br>
ORA-02168: FREELISTS 值無效 <br>
ORA-02169: 不允許的 FREELISTS 存儲選項 <br>
ORA-02170: 不允許的 FREELIST GROUPS 存儲選項 <br>
ORA-02171: MAXLOGHISTORY 值無效 <br>
ORA-02172: PUBLIC 關鍵字不适用於禁用線程 <br>
ORA-02173: 無效的 DROP TABLESPACE 選項 <br>
ORA-02174: 缺少要求的線程編號 <br>
ORA-02175: 無效的回退段名 <br>
ORA-02176: 無效的 CRATE ROLLBACK SEGMENG 選項 <br>
ORA-02177: 缺少要求的組號 <br>
ORA-02178: 正確的語法是: SET TRANSACTION READ { ONLY | WRITE } <br>
ORA-02179: 有效選項: ISOLATION LEVEL { SERIALIZABLE | READ COMMITTED } <br>
ORA-02180: 無效的 CREATE TABLESPACE 選項 <br>
ORA-02181: 無效的 ROLLBAC WORK 選項 <br>
ORA-02182: 需要保存點名稱 <br>
ORA-02183: 有效選項: ISOLATION_LEVEL { SERIALIZABLE | READ COMMITTED } <br>
ORA-02184: REVOKE 中不允許資源限量 <br>
ORA-02185: COMMIT 後面跟的標記不是 WORK <br>
ORA-02186: 表空間資源權限不可與其它權限一起出現 <br>
ORA-02187: 無效的限量說明 <br>
ORA-02189: 需要 ON &lt;表空間&gt; <br>
ORA-02190: 需要 TABLES 關鍵字 <br>
ORA-02191: 正確的語法是ET TRANSACTION USE ROLLBACK SEGMENT <rbs> <br>
ORA-02192: 回退段存儲子句不允許 PCTINCREASE <br>
ORA-02194: 事件說明語法錯誤  (非致命錯誤 ) 接近 '' <br>
ORA-02195: 嘗試創建的對象在表空間中 <br>
ORA-02196: 已經指定 PERMANENT/TEMPORARY 選項 <br>
ORA-02197: 已經指定文件列表 <br>
ORA-02198: 已經指定 ONLINE/OFFLINE 選項 <br>
ORA-02199: 丟失 DATAFILE/TEMPFILE 子句 <br>
ORA-02200: WITH GRANG OPTION 對 PUBLIC 不允許
</div>